[
    "It is completely insane to me that we just casually hit all of these things in one go. You know it's ridiculous when there's no room to advertise the Wooglets + Apex synergy because it's not even the strongest thing in the build.",
    "thandks for the vedeo",
    "Bruh the amount of high rolling in this video made me go through all 5 stages of grief. Amazing work.\nAlso, the title I got:\nSecret \"Augment 405\": Double Minionmancer + Apex Inventor GOD Tier Highroll League Arena Gameplay",
    "Secret \"Augment 405\": Double Minionmancer + Apex Inventor GOD Tier Highroll this is the title i got i stg its always GOD tier something in my recommendeds lol",
    "mario <3",
    "peak",
    "ngl even tho I love seeing the builds, the best part of this videos is just \"bros being bros\"",
    "Awaga Awoogoo",
    "Love this vid nidd thank you. You're my favorite youtuber right now",
    "playing with noclip is crazy. i would lose my mind.",
    "6:30 QUALITY 4",
    "Oh yeah baby, engagement time",
    "I got the title \"Secret 'Augment 405': Double Minionmancer + Apex God Tier Highroll\" and I really liked it! I think the augment 405 part was def a really good hook (and I just clicked without reading the rest), but I don't really know if other people feel similarly or not",
    "Secret \"Augment 405\": Double Minionmancer + Apex Inventor GOD Tier Highroll | League Arena Gameplay\n\nand its okay",
    "12:45 Homie Mario showing them eses",
    ">looks inside\n>too much shit\n>looks outside\n>too much shit",
    "How do you get golden border ?",
    "Title i got: Secret \"Augment 405\": Double Minionmancer + Apex Inventor GOD Tier Highroll\nvery good.",
    "I was a casual for fun aram player. Since you are posting arena content, I am watching you everyday. Now I feel I became the most try hard player in Aram.",
    "6:23 tier 4 item",
    "Thanks for remembering me to like, my dumbass would forget about everything",
    "Really good video",
    "15:30 could also be -3. or ASCII group separator. or",
    "14:29 “I love destruction” while also simultaneously raising an army of grubs is insane",
    "12:57 THE PREDICTION GOES CRAZY",
    "Illaoi, tentacles\n\nVel Koz, tentacles\n\ni see i see",
    "Your right. What a crazy high roll",
    "Now try all hat video(fans involved fir the sake of sanity) where you get aug 405 with mad hatter",
    "congrats on 200k. idk if the title i got matters because I watch you daily regardless of title lol",
    "405 perfect infinite zhonyas double Minionmancer + kayn E idk man lsd",
    "6:09 what is selling the rod thing?",
    "engagement comment",
    "Youre always carefully crafting the most obnoxious and frustrating builds to play against lmaoo",
    "algo boost",
    "Secret \"Augment 405\": Double Minionmancer + Apex Inventor GOD Tier Highroll | League Arena Gameplay  and i really dont read the title just see the image and click",
    "We get:                       You get:\n\nInsane video              Liked & subscribed",
    "this might be one of the best videos you've put up",
    "do mario and erik have a youtube channel or something ?",
    "I just saw the thumbnail that said super secret augment and its names was an error code so i clicked it",
    "This was fucking insane to watch",
    "Would it be possible for you to do a few builds where you focus on massive amouse of healing or sheilding? like support based i know you dont like doing it often as it doesnt pull as many veiws but id love to see more!",
    ">looks inside \n>checks nidhogg's reply\n>gets got",
    "Stewie2k reference",
    "have my like and 21 minutes of watchtime",
    "Augment 405? Insane double minionmancer and apex godrun was my title. Ngl tho I just watch whatever vid you post. If it's a control mage, fun adc(twitch, mf, tristana, etc), or some troll concept that shouldn't work, I watch right away. If it's a beefcake I usually click off, and then watch it later anyways cause it's still gonna be good.\n\nHope the info helps. I like how you do your stuff and how you market. The impression your marketing gives is like \"Doing what I have to even though I'd prefer to be specific\", which is perfect to me.",
    "Nice videos but the insecure talk about comments is starting to be boring and repetitive.",
    "king nidhogg velkoz is giving me cancer but it's fine I still love him",
    "Ah, the classic con crud. I can tell it can't keep you from your uncanny highrolls.",
    "The title I got was: Secret \"Augment 405\": Double Minionmancer + Apex Inventor GOD Tier Highroll | League Arena Gameplay\nHonestly that was intriguing enough",
    "I love how persona 4 specialist just become so deeply rooted in binding of isaac when getting Q4 items"
]