[
    "Do you know what they do with nuclear waste in your country?",
    "Why can't it be recycled again? Is it tied to costs or is there another cause?",
    "because germany prefers to burn gas",
    "The uk stopped there reprocessing plant I think it was Magnox.",
    "I have no problem with nuclear energy. I just dont trust our government to make a plant to spec or not sell nuclear material to the local terrorist group",
    "4:53 - There's the reason why. Plutonium mines don't exist, and nuclear proliferation concerns are more of an issue with fuel reprocessing than cost, or safety, or anything else for most countries.",
    "In the future if greed doesn't stall it, I believe fusion will be the new source of energy, with \"spent\" fission products being used as the fuel.",
    "\"nuclear waste is reusable\" - brought to you by the creators of \"PFOAs are perfectly fine in water supply\" and \"teflons c8 is now c6 (genx) so it's safe, trust us\".",
    "So practical and easy to apply.",
    "Bro isn't shy about rockin' that fanny pack.",
    "9:58",
    "We aren't doing it because, money",
    "I never understood how refining ore could be more cost effective than refining spent fuel.",
    "6:02 Let's get warm water (not boiling) instead of electricity then. We consume electricity to make warm water anyway.",
    " cow's are flying on the internet!!!",
    "Classic perogative: Can we do it? Yes. Is it better? Yes. Is it cheaper? No. Okay, then we don't want it.\n\nThat and the US fearing that Godforbid, anyone might have the power to not kowtow to them.",
    "A random guess: Politics\nAnother \"random\" guess: money",
    "Why can't we just turn it into plutonium rods and put it in the awesome sink? It's really not that hard.",
    "What happens with chemicals used in this process - i.e. acids used to separate waste? Doesn't this process render them radioactive?",
    "People discussing about reuse me thinking about jadugoda people condition. So sick ",
    "This seems like it will hurt the bottom line kind of video",
    "In a molten salt reactor, the actinoids float to the top and can be removed, leaving the good fuel behind. Achieves 97% efficiency instead of 3%.  Can also theoretically use \"spent\" fuel",
    "its often turned into bullets and shot into whatever overshore engineered hellhole",
    "The first minute passed, and when she said \"why\" I just told myself \"because people can't be trusted\"",
    "when i opened the video and thought what was doing leenbeefpatty in a nuclear waste video and then realized she was a different person",
    "Untill we produce energy from nuclear fission/fusion directly and not boil water and spin a fan.. it's not that high-tech. Windmills and solar seems better.",
    "Because it's not. Close video, move on.",
    "It's all about profits and control, the evil of humanity is what stops us from advancing, you can see it all over the world, people ending other people, young, old, children, does not matter and the ones that end up at the top making these decisions are always the worst ones that humanity has to offer.",
    "Canada is.",
    "One of the only good arguments against nuclear reactors that I’ve heard and there seems to be no solution for is that it provides targets for bombs. If a country were to decide to strike another, their nuclear reactors would be a perfect target. It would not only result in a catastrophic disaster but also a huge loss of energy. I’m not sure how that stands up to current mainstream energy sources but it is something to think about.",
    "Because oil is too big",
    "As a person that wanted to be a environmentlist politicians end of discussion.",
    "Can we stop the bright green glowing barrels of doom that kill anything that comes to close to it agenda/meme ? \nthanks",
    "12:43 yo is that nuke",
    "What’s the part? I don’t understand if the spent rods are 95% full and can produce steam. Why don’t they use that steam to produce energy?",
    "Even the \"true waste\" is chock full of precious metals and rare earths.",
    "Can't you burn the leftover fishion products and use it as a fuel even if it's very inefficient?",
    "basically we are not repurposing it bc usa is a scared lil b xD",
    "Is it just me or does nuclear energy just not seem worth it at the moment? Nuclear is expensive, recycling the waste is even more expensive and all recycling really does is put it back in the loop for 5-10 years until it becomes waste again that is unrecyclable. On top of the threat of nuclear weapons / terrorist attacks.\n\nLike just build some offshore windparks or something and be done with it? What am I missing. Why are countries still investing in it?",
    "11:20 I wonder if this includes the cost of the waste storage.",
    "Short answer: it’s cheaper to use new then recycle used. Capitalism.",
    "Put some in your water love. And chug it down. Not me thanks",
    "Так в России например используют МОКС топливо, почему в остальном мире не используют?",
    "Actually the main reason to build nuclear powerplants is not cheap energy, as it is not so cheap in the long term, but to obtain plutonium for nuclear arms. This is why the countries wich have a nuclear arsenal have so many noclear power plants. Countries without nuclear arsenal still build nuclear power plants in order to get in toch with the technology and be able at some day to build nuclear arms. Another reason is, of course, the prestige of being a country so advanced that it has nuclear power plants.",
    "French propoganda",
    "I mean, depleted uranium is still used in tank rounds.",
    "I hate this cost argument when it comes to nuclear waste recycling. There is so much money wasted every day for useless things, but when it comes to being responsible with our waste, its to expensive.",
    "The answer is really simple.  The environmentalist want nuclear energy to be as dangerous as possible so it will be easier to ban outright.\n\nIts ironically similar to conservatives not vacinating their kids for hpv to make sex more dangerous to discourage them from having sex.  Its the exact same thing, really.",
    "when something is recyclable but not used it means one thing - recycling must be more expensive than production. (due to this or other reasons)",
    "And there's an even cooler thing that some of the fission byproducts can be used for : RTGs for spacecrafts that can produce energy for several decades!",
    "Does the waste recycling have to be so complicated? What about using a heat exchanger to extract that heat energy? Or what about peltier elements to make electricity?",
    "The barrels in the pictures at the start are more irradiated material than radioactive material. There might be some radioactive material, due to neutron activation, but those barrels are for medical material and the like. Reactor wast is put in the huge tanks made of multiple layers of steel and concrete. And are gray or greenish.",
    "Russian reactor БН-800 is operating for already two years using ONLY WASTE NUCLEAR FUEL from other reactors... And this type of reactors on fast neutrons can be used to produce nuclear fuel out of depleted waste.  It seems like campfire, where you you adding 3 logs in, get out energy and then take out 3 logs back (but new logs only can be used with previous types of reactors. But when they get depleted there - go another round) . We build several more reactors of this type. Think about it!",
    "Why?\nRemaining 4%",
    "Rare france W",
    "If anyone asks the question of \"if X is good, why aren't we doing X\" the answer is always money.",
    "not profitable? Anything in capitalism which is not profitable wont be done",
    "could we use those constantly heating byproducts to make free warm water for people to use?",
    "The protest movement against nuclear in germany was the first time I realized that maybe the people aren't always right.",
    "9:58 The low taper fade is still?",
    "I mean I would take at least 3 if they are free?",
    "I bet there will be a bacteria that eats nuclear waste if you leave it to nature",
    "Rich white men.",
    "great video, cheers",
    "I would think a nuclear armed country would be interested in nuclear fuel reproccessing/recycling as a source of both plutonium and additional fuel for reactors.",
    "fuck mbappe",
    "Still dont get why we dont harvest the energy later on when its not suitable for normal powerplants.\nLike \n1st use, powerplant\n2nd use, smaller turbines, its still way over 100 degrees hot for years so it still produce steam and energy with way lower chance for critical mass emergencies.\n3rd use: heating up water for households for decades.",
    "I haven't watched the video. The answer is money.",
    "Kovarex enrichment process",
    "\"Why aren’t we doing it?\" - Because none of you hold your authorities or corporations accountable for the garbage they do every single hour of every single day. Maybe you should do that.",
    "They don’t want you to know its recyclable",
    "Money and power. Probably money.",
    "Just make Plutonium Fuel Rods and dump them into an Awesome Sink ",
    "Why can't the spent fuel rods power fuel cells",
    "My father was involved in building two major Nuclear Power plants in Germany. According to him, nuclear power was one of the solutions to stop using fossil fuels, with German reactors being some of the safest in the world. He's still angry at our government",
    "einfach zu beantworten:\nis billiger neues zu benutzen, gleiche mit plastik! \nund die milliardäre, die das alles besitzen kümmert das doch alles nicht, solang die kohle hinterhergeschmissen bekommen, versauen die weiter die welt",
    "1:01 So the issue is… once again Europe ",
    "this should be highly specific and not the general \"nuclear waste\"\npeople should know it also includes used apparatus that has been radiated by something right?",
    "So we have a lot og waste that gets stored in the caves rather than be recycled. Could it be taken out and recycled in the future when it becomes profitable?",
    "I'm french, and despite being kind of the leaders in nuclear waste recycling, our nuclear program is VERY flawed because of politics. A lot of innovations are not being pushed because of european energy market. If we continued huge developement ever since we started nuclear programs we might have been even more advanced. But that's not good for politics apparently.",
    "Yeah they also said plastic waste is \"technically recyclable\".\nNuclear energy and recycling is not feasible without huge subsidies. The cost of nuclear power plants is insane. \nRenewable are way easier and cheaper.",
    "Because this story never was true. It would be economical nonsense to do it, and the (also nuclear) waste volume created by it would just grow. Neither „Transmutation“ nor „nuclear recycling“ will solve any of the problems of nuclear fission. That is not true, there is one solution: just stop producing more nuclear waste every day and use much cheaper and cleaner renewable energy. Nuclear fission was an error to begin with, it was mainly done for military reasons on a scale that had to be sold to the public. It always was uneconomical expensive, unpractical and dangerous, as proven several times in history.",
    "Not every nuclear waste is depleted nuclear fuel rods.",
    "Because every green party and Europe intend to destroy Nuclear plants and use more fossil fuel because they're stupid, it's that simple.",
    "Because germans are morons. There I saved you 30 minutes.",
    "imagine a global south country having a MSR, the US would make it their goal to blow up that power plant because they don't want the world to have nice things that the US doesn't control. they literally air struck enriched Nuclear material this year! in 2025! with all their shit about the environment and guilt tripping consumers into wasting money on green washing while airstriking a HIGHLY radioactive refined uranium ...",
    "Let me guess ((they)) are behind it",
    "for now they dont need to develop the process to recycle but when  they do need to it will be way to expensive in the future. where as in theory if they develop it now it could be cheaper in the future when they need it.",
    "We use it to make depleted uranium ammo",
    "Good for France. I never thought I would say something positive about France. Good for them on carbon free energy production and recycling Nuclear waste. That's what should be pushed.",
    "Just harvest the giant Nuclear Reactor in the sky...",
    "steel doesnt melt? hmmm.........",
    "USA does recycle nuclear waste! They put it in bombs and munitions, then they bomb innocent countries and dump all that waste through the use of bombs and bullets.",
    "Does this count as steampunk?",
    "Uranium mining is only less expensive, because colonization has weakened the nations where it is mined, so that they can only get paid a pittance of what uranium is worth and not demand proper environmental regulations for mining that would protect their citizens but would drive up the costs.  Good thing France is continuing to invest in recycling nuclear fuel, because many leaders of the global south are beginning to cut uranium supply off to European countries that colonized them.",
    "As usual, the UK giving up.",
    "Don't you talk about molten salt reactors (aka thorium reactors), which should be able to run on nuclear plant's waste ?",
    "Nuclear waste has a shelf time of 1 million years. I think by then wd will get 100% renewable nuclear energy that reuse xaste and produce no waste. Legitimately dont worry about it.\n\nAnd btw 1 of those barrels is the nuclear waste of 1 nuke plant per year, whereas fossil fuel plants produce waste the size of singapore yearly.",
    "The world is sick, how they demonize nuclear energy and not even recycle it is crazy.",
    "So France is the biggest recycler of nuclear waste, not Russia? Lmao",
    "reactor thorium makes nuclear waste less dangerous why hasn't France teamed up with the leading Danish company to build a thorium plant? it would solve the problems of long-term storage",
    "As usual, corporate greed getting in the of sustainability",
    "Germany is not doing this, because merkel and the likes love the smell of the russian gas",
    "Oh huh, the american is upset at countries reusing and recycling, how unforeseen. Also, pretty sure the US is whinging about it because it requires the state to take responsibility economically. Their whole \"the world shall burn so we can prove the free market can self regulate\" seems like the hill they are dying on, hopefully we wont all die on it.",
    "Because if people stopped being scared of nuclear power and understood it's the best source of power generation we currently have in terms of sustainability and reliability then we wouldn't have to pay for oil and gas anymore and thats not in line with the global elite's goals.",
    "Yeah instead we get solar panels, that use silica mined by African children. \nBut nuclear power bad, do not use it. (So stupid)",
    "7:52 one metric tonne of oil is actually approximately 7.5 barrels. Not 21 as shown… but otherwise, very cool video.",
    "There's a very ver very big difference between saying nuclear fuel is recyclable and nuclear waste is recyclable. The vast majority of nuclear waste isn't fuel, and you likely know that, so why did you choose this intentionally misleading title?\nHere's an accurate title for you: Only 3-5% of nuclear waste is recyclable",
    "Nice video but you forgot an important point : France has only small domestic Uranium source. It's the main reason it decides decades ago to invest so much in recycling : being able to maintain operationnal nuclear reactor in independance of external providers.",
    "I say more weapons",
    "Places are going to go nuclear more now because ai makes it needed for corporations. They didn't want it before since it would mostly benefit normal people. Its all about what benefits the corporations and governments not the people.",
    "Undisputed leader in nuclear recycling - France.. You can't cancel Russia, you know.. ",
    "What is not shown on the video, are the gallons of liquid radioactive waste Uranium Fluoride that are produced during this so-called “recycling“ process. Nuclear propagandist don’t want you to know how many football fields are needed to store it. During the “recycling“ of 1kg of MOX fuel, 6-7kg of UF is produced. So-called recycling increases the amount of waste  and it’s impossible to guarantee safe storage of this chemically and radiologically dangerous compound for many years to come, due to huge amounts of it.\n\nThat’s why smart countries don’t ”recycle” radioactive waste. So as not to multiply it!",
    "Actually, this video did not answer the question of  \"Nuclear waste is reusable. Why aren’t we doing it?\" Because, I can show you right here. Why we aren't. Simply by asking \"Whom here would trust their and the health of their offspring to a US corporation engaged in this? Anyone? Volunteers?",
    "woozy",
    "Amazing!",
    "Smite the Heathen! She disputed the evilness of nuclear power!\nOnly Russia nuclear power is good nuclear power!\nBecause they use it to build Anti-Liberal^WFascist nuclear weapons to scare off Liberal^WFascist minor^Wevil powers. The only other good nuclear power is Chinese nuclear power. Because... well, I guess the same reason.",
    "Important that public has sufficient education and awareness on nuclear safety. Important that it doesn't fall into the wrong territory or group.",
    "so I'm less than a minute in and I'm going to guess it's cheaper to get new material than it is to recycle old material.",
    "There is quite literally nothing stoping you from doing so.. but yea, let’s keep making cute YouTube videos",
    "Or better yet, why are we not building NEW reactors that do not put out waste. I mean we already have the technology available.",
    "Nuclear waste is hot. Paris Hilton",
    "The thumnail of the barrels is not nuclear waste.",
    "The truth here, and is that France has an independent nuclear weapons program - they need some plutonium for that cause as well. Also, I do like the sustainability aspect.",
    " NON ISSUE \n\nNuclear wastes represent just a few cubic meters that you can shelter safely underground and forget about it. It will remain there forever even in case of earthquakes or global catastrophes like natural Uranium does and always has, so there’s nothing to worry about.\n\nThose wastes are NOTHING compared to plastic waste or other polluants and do not worth the effort or energy to bother recycling, while there are infinitely more pressing issues to spend time and global focus on: climate change, fossile fuels depletion.\n\nWe NEED nuclear power as much as possible to tackle those issues, and blagging about its almost non-existent wastes / pretending we should recycle it is absolutely counter productive.",
    "The same tech can produce nukes, that is why the US and other nuclear powers have made it near impossible to do.",
    "no one of named countries is trustable 100% even France.",
    "Какой-то набор пропагандыпереработка оят - это 101% военные технологии. Нет ни одной причины с этим связываться если вы не делаете бомбу",
    "Omg you look like lean beef patty.",
    "So we do some things bc america is terrified someone will get a nuke.i had a  teacher many yrs ago he always said prove it.i do not believe in this nuclear holocaust,that going to wipe out civilization.its simply a far right american fearmongering tactic.i could shoot nukes for months and not put a dent in civilization.maybe fly a plane full of radioactive waste into the mississippi river.but your simply not going cook everyone in america with a nukejesus christ i can drive for hrs and never see a house",
    "Show me one plant that recycles nuclear waste on a regular, daily basis making a profit - not a research lab or one where  military use subsidises the cost … hint: there is none … \nand we have thousands of tons of mixed nuclear waste to be dealt with, it’s not rods only",
    "The problem in the US is that Green/Liberal politicians have regulated Nuclear as a non-green energy, lumping it in with Coal and Natural gas, so that there is little to no funding of research into recycling nuclear waste.\n\nMost states have regulated and banned the building or expansion of nuclear in their states, only allowing Solar or Wind as viable new energy sources. Maryland right now only have one Nuclear plant and is having legal battles taking over owners land to add more powerlines to import Nuclear generated electricity from Pennsylvania because they want to shut down a coal power plant that is run only during peak load, and the state has legislated that the Nuclear plant cannot be expanded.\n\nAs Liberal states mandate more Electric vehicles, they are having more shortages of electricity supply but have limited ways to produce it.",
    "it's just that solar energy has evolved ahead of all this...",
    "back in the 60' there was in the USA a nuclear power plant which solely used radiactive wastes. The reason it closed was erased from the reccords and most of the information on it too.",
    "Simple as that, because THEY have no interests in providing cheap (its a waste), super save (with proper handling), effective, enviromentaly friendly. By them I mean whoever has the influence on that topic in your country: politics, enviromentalist, NGO's, labor (miners for instance), big corpo or other sectors that would loose money on that. That's politic, its all about who gets the money (elite, CEOs, shareholders), not what's good for people. Believe, with a good message you can convince people about the safety (when you know how safe, then its not a problem anymore). In Poland we don't have nuclear plant because of the Chernobyl, people were to afraid, plus there is a strong lobby from polish miners and NGO's (on the Soros payrol ;) ). So we don't have nuclear power, we have horrendous price for the electricity (probably the highest in Europe), because of the \"safe the globe\" taxes (ETS) and old infrastructure. Always FOLLOW THE MONEY, then you find answer! Be safe!",
    "from fossil fuels to nuclear never do they ever learn from one disaster to another nuclear is unusefull as waste material and even after being used up you still have to deal with waste material that's too toxic so ending up with making more places to store until you have no more space or until another disaster happens when those buildings infrastructure will leak toxic materials and then you have more problems than you have ground in safe zones that are not affecting the environment from exposing toxic materials. whether it might be natural disaster or manmade either way when those buildings and storage will have mean for nothing. when there is a way for a disaster waitin to happen guess what it ussually does and yet it happens at times when you least expect it",
    "The answer in our Capitalist world economy is always MONEY.  If it were more profitable to recycle nuclear waste than using mined uranium then it would be the standard practice.  Part of the reason just burying nuclear waste is more profitable is because that cost is borne by the government.  So it’s not just how expensive it is to recycle vs refine from mined ore but who wind up playing the bill—the Capitalist or the taxpayers and government debt holders.   The government doing it is of course Socialism, but that fact is conveniently overlooked by the Capitalists who avoid paying taxes ",
    "So how safe is all this waste? Say someone wanted to destroy this site? Are people safe?",
    "The worst pollution coming from chernobyl, is the misguided green politicians that grew up after that tragedy and drew the wrong conclusion that, just because commies cannot run a nuclear plant, that means nuclear power isnt clean",
    "The originals molten salt reactor would counsume near 97% of the waste being spoken of. And they cant go critical even when they go critical.",
    "Compare the waste from each time of energy source now.",
    "Not true. Nothing nuclear that's in any way usable goes to waste. There are even some countries/people who would be happy to get their hands on radioactive toxic waste to put into a dirty bomb. Everything that can be recycled from this expensive technology, is. Recycling, reprocessing fissionable material is big business for some countries. They import other countries' nuclear waste, recycle it and resell it. What can be reused, is reused. The toxic unusable dross is what gets dumped. I'm against nuclear (fission) power on principle (as much as the very real dangers) until they crack fusion. But they can't crack fusion without the research and work done via fission reactors. They're needed, but not in the proliferation they're getting, much of which has to do with military tech as cheap electricity.",
    "I'm wondering, if they're recycling nuclear waste, can they pricess plutonium 238 specifically? \nThat's the stuff NASA uses for long-range and long-term space probes like Voyager, and it's extremely hard to get.",
    "I still think that nuclear is the reliable source of energy if we have to replace fossil fuel.",
    "ts lowkey look like half life…",
    "Economics.. recycling nuclear fuel is dangerous  and expensive",
    "Canberra/ Ariva are among the best at repossessing spent fuel rods.",
    "First of all, nuclear energy is dangerous. See Fukushima and Tschernobyl and the dozens of close misses. If you want this on your back yard you are delusional. \nSecond, you can't deal with the waste. If you price waste disposal into the electricity bill then nuclear energy is the most expensive. How do you price storing something extremely toxic for millions of years. How do you even design warning labels that last this long. \nThird, we live in capitalism. If it is cheaper to buy new than to recycle then you will buy new. Also recycling nuclear costs energy, also produces highly toxic waste, and in the end is just the same or worse then buying new. And when you can store waste cheap in countries with lax environment laws then it's easy to get rid of waste.\nEvery couple of years someone thinks they need to rediscover nuclear and they think it's great. Nuclear energy is great when you ignore the waste completely and you think you only need a 99% chance to be at 100% safety. Nuclear energy is something humans did that they never should have done.",
    "Like the boots",
    "Isn’t it something to do with recycling used rods produces weapons grade plutonium and most countries are signed up to nuclear proliferation?",
    "Because only Russia and China have competency in nuclear tech",
    "But we experimented and showcased the most safest explosion. And not by bombing hiroshima.  Tland the work accepted as a nuclear power.",
    "US did not supported India, because they don't want any more nuclear power countries. And US thinks they are the saviour of all. I hate such illogical explanations.",
    "Why?... I don't think you know who 'really' runs and controls this world. 'They' don't care.",
    "Russian ROSATOM state corporation already reuse radioactive wastes in their BREST reactors. Have you ever heard of it in Germany? Bet they do not want you to know it.",
    "Nuclear waste batteries are a thing now too",
    "9:59. You know what else is massive?",
    "Because the average rouge person Can Create Dirty Pomp's . ( Nation Trust Issues )",
    "The most burning material comes from waste ground - I wonder if that dump was made by humans - I guess not - to perfect",
    "Who created the system like this that they have so wasted everywhere",
    "talking about nuclear waste recycling? by  a Germany tv channel?\nhow about starting from: 'why aren't you restarting your nuclear plants?'",
    "In the US it's not recycled because of early laws put in place.  This should change.",
    "\"Waste\" is a hell of a lot more than just old fuel rods.",
    "Where are all the climate activists its the most renewable energy",
    "build up thorium reactor and you mix with nuclear waste to use like fuel so you cant even recicle it without contaminate the ambient. clap clap this technology exist allready in 60s now china is doing that",
    "Forget about the recycling, we just witnessed a french speaking english",
    "Damn India sounds impressive when you realise that nuclear energy has the smallest share in total energy",
    "They do it responsibly.",
    "Great video I really enjoyed this, however one point that needs mentioning that the costs associated with uranium pale into insignificance from the building and running of a Nuclear power plant. It's currently around $150 a kilo but even at the four five times the costs the price is still insignificant. I'm sure I also read somewhere that to recycle a kilo of waste is around $1500 so ten times the amount of just getting new genes why most countries just get raw uranium.",
    "Add it to cereal and you have glow pops",
    "@ 9:58 - 1002 That's what she said.",
    "This is almost as toxic as 4chan.",
    "La Hague is an impressive and very important facility – it plays a key role in reprocessing spent nuclear fuel and recovering valuable materials. Don’t take this as pure fact, but as I have understood it, France and many other countries do not yet have a permanent geological disposal site for the high-level waste that remains after reprocessing.\nIn contrast, Finland is building Onkalo, the world’s first operational deep geological repository for spent nuclear fuel, located at Olkiluoto. While France leads in reprocessing, Finland is pioneering permanent geological disposal. Both approaches are essential parts of the global nuclear waste management picture.",
    "Why don't they use thorium technology",
    "Saving it for later",
    "Here is a big mistake. It is not possible to use recycled plutonium from civilian nuclear power plants to produce atomic weapon. Otherwise, this bomb will be unstable due to U-240 and may detonate at any moment. This approach is too unpredictable and challenging; no state has used it to make nuclear weapons, including India. India used Cirus reactor (not Candu), which design is really suitable to produce uranium-239.",
    "If it create heat, its free heater on colder region",
    "nuclear waste  you can use in missile",
    "11:30: Bullshit. Five times more waste volume requires five times more cost in storage construction and pushing the burden more down the road to next generation.",
    "Fair point ....recycle it instead of making glow in the dark chalk out of it and giving it to toddlers ....call me crazy but she has a point",
    "is much too expensive and much too dangerous - only Greens would do such an idiocy",
    "One thing that people are forgetting when it goes to be buried in the ground it isn’t really buried forever as often left in long-term storage until the recycling happens so it’s not a case it isn’t happening. It just hasn’t happened yet.",
    "Materials Science needs to figure out how to neutralize radiation.  Maybe adding other elements to the fuel could cause a reaction to leave no radiation.  Have to get smarter and solve Fusion.",
    "The problem that is not addressed is the massive amount of low level waste that is generated: contaminated coolants, concrete, safety equipment and tools.\nThe nuclear industry needs to do some thinking on minimising this contaminated material, and managing it's disposal.",
    "because lefties don't want cleaner energy/planet, they want government control and power. Today is energy and culture, yesterday was labor, tomorrow whatever they can push as social division.",
    "Why is DW so much better  than the \"Öffentlich Rechtlichen\" ?\nAnd its even funded in a more just way. By taxes instead of a flat fee, which is a poll tax.",
    "Nuclear waste is reusable, why aren't wr doing it?\nAns: you people suck, that's why.",
    "France is the leader in something? I almost forget France is still a country. They remind you of Egypt in that they are historically relevant but are almost irrelevant in the modern era. Good job France. You can be known for more than violent protest over wine tax increases!!!",
    "Screw that. MORE M829A4 APFSDS",
    "There is a company called ASP Isotopes that can potentially re-enrich spent fuel and tails.",
    "One question. If you wanted to reuse it. Why encase it in such a fashion where it would be horrible to recycle.   And yeah it is cheaper to buy uranium. And when the USA or which ever country  they can choose to recycle or sell waste it's still a asset",
    "What about Fast Breeder reactors?",
    "Its like eating the fruit and throwing away the peel and seeds... oh wait.",
    "A great deal of disinfo against the LFTR MSR, no fuel rods needed, no giant cooling towers needed, and make pu-238 rtg power cells that last 80 yrs.\nchina is now running a variant of the US reactor made at ORNL in the 1960's, it is the best solution and would power the world for a thousand years if not longer.\nIts would do so much cheaper, much safer, and fails passively to a passive cooling tank, and they did so every weekend at ORNL for 6,000 hrs.",
    "Officially, because the techniques involved provide the basic know-how for bomb material. But given that those that wanted nuclear weapons got them anyway, I don't support this argument.",
    "Nuclear engineer here... Put simply... it's a lot more complicated than that. Disregarding laws, trained personnel,  and Made to order machinery, just to name a few things, the physical reality of reshaping, refining, and repurposing separate materials for use requires a dedicated industry to accomplish. Also, we don't use the same fuel. Not even in our own country.",
    "0:53 it’s because people are really uncomfortable with nuclear power in general",
    "Without watching the video, I'm guessing it's not profitable or not profitable enough.",
    "its stay Radio activ for 100000 of thuniend years, THAS EXCATLY WHY NOT TO USE IT, also its the most dirty metrial to dig up from the ground. This is so stupied.",
    "Human chimps need neuclear fuel to heat water so steam can turn a turbine and generate electricity. Neuclear waste that we'll be here for more than 10 thousand years. We are living in the simpson universe. And here I am without my rhubie slippers.",
    "comment",
    "There's ALOT we can be doing to make things better. We don't or better put, are not allowed to make things better. We are told lie about everything and the second someone tells the truth its killed.",
    "So, you need protective suits to be inside this plant. Hands and face are immune.",
    "What waste are they receiving from Australia which has no nuclear programme?",
    "Nano diamond tech has been powering heart pace makers for decades without recharging and micro tech has made quantum leaps but coal and gas warlords got a death grip on the energy sector",
    "It's funny the Netherlands ships the \"waste to France\" to recycle",
    "I know how to fix this.\nMake nuclear identify as solar.\nProblem solved.",
    "0:49 49secinds in and my best bet is, it has everything to do with money..",
    "If you look up \"shortsighted\" in the dictionary, you see a picture of a human. It's stupid, but then so are we. The only way you get more long sighted policy is a good government with experts that the people trust. I'm glad to see the planet of at least half of my ancestors actually do it right. Maybe some day we'll find a way to reuse the fission products too. It won't happen unless we try.",
    "I remember France openly dumping the waste into the ocean.",
    "Correction: \nThe \"collective West\" is not recycling nuclear waste.\nRussia recycles its nuclear waste and accepts nuclear waste from some other countries for recycling.",
    "France steals African country nuclear resources and leave the country without electricity and doesn't pay. Wicked people",
    "Reducing the need for fresh uranium by 30%, and using the resulting mix to produce only 10% of your electricity doesn't sound much like you have achieved \"sovereignty\".\nThere is something else missing here too: not all Pu is removed, and other minor actinides with high radiotoxicity and extremely long decay times (tens of thousands of years) remain in the waste fraction, and still need long term geological repositories.\nPu recycling is not an effective enough method. Only fast burner reactors could really solve the eternal nuclear waste problem, leaving us with only fission products to deal with for a few hundred years instead of 100 thousand. But these technologies barely ever made it out of labs and demonstrator plants in the past 50 years.",
    "Storing nuclear waste for millions of years is expensive. Thanks to the \"Atomausstieg\" Germany doesn't need to store nuclear waste anymore and is able to use cheap renewable energy from wind and photovoltaic power plants.",
    "After France ...it's Russia and India when it come to recycling Nuclear waste",
    "If the rods in the shipment container is 300-400 Celcius hot  (as explained in the video), why not use it directly to heat and produce steam?",
    "That 5 to 7 years of cooling is such a huge waste of energy. There has to be a better way.",
    "Curious to know why Australia has a contract with them but no nuclear reactors?",
    "I think it has to do with the creation of weapons grade plutonium as a result of recycling nuclear waste.",
    "Because Billions were wasted on Wind and Solar scams to line Democrat pockets",
    "God I love France! And how they recycle.",
    "When I was working at Los Alamos National Laboratory we had a proposal for accelerator transmutation that would even recycle low level waste, while producing electricity.  No one wanted to fund it because nuclear power was a 'dying technology.'",
    "At least nuclear waste is stored in a way where it would easily be accessible if needed in the near future.",
    "1:50 what are thooose ",
    "Yea they already recycle it in artillery shells and bombs",
    "Russia: advanced in this field farther then anybody else with fast neutron reactors\nDW Journalist: we will go to absolute leader in this field, France",
    "You look like you’re from the future in that jumpsuit",
    "If I was France, you can bet some of that plutonium would be set aside in another location. Because ya never know",
    "Rosatom is the only company that do a full recycle in the world",
    "no more nuclear for you until you clean up your mess!",
    "So, the nuclear energy is not as pure and waste free, as its advertised? Everyone talk about how we can recycle waste (thus proving its not dangerous) but in reality almost nobody does it? Thing to consider, before we build another hell powered steam engine, because rich lobby tells us its completely safe. Maybe in modern times there are better solutions than atom?",
    "Same reason the water engine exist but we don't use it.",
    "Clay is a good natural anti radiaton item",
    "Because its very dangerous and highly combustable",
    "Correction most of the fuel comes from Burkina Faso, Mali, Niger",
    "Because of Jimmy carter",
    "what about the remaining 4%? as long as the country that uses it doesn't ship it out and commits to hold it responsibly for the next 10,000 years. its okay.",
    "Because Germany didnt want Dual-Fluid-Reactors because of Green Ideologists. Dual Fluid Firm is now in Canada. But if Energy is getting cheap corrupt politicans wont get so much money from the Energy Companys anymore. Thats why.",
    "Air berat tu sesuai untuk fusion reactor punya fuel ",
    "I am a nuclear waste professional. The issue in America is regulation and bureaucracy. Proliferation is the 1# issue 2nd among many is final disposition ie burial.",
    "LMAOOO its so obvious, big oil just wont let it happen cuz of MONEYYYY ",
    "Spoiler alert RFK Jr takes it all and puts it in a swamp and then swims in it with his grandkids. Then he drinks it, and that’s how humans get radioactive brain worms  ",
    "The gaol is to provide the best sex dungeon experience for the core of the CCP.",
    "The U.S. Congress outlawed recycling in the U.S.A. The U.S. Navy can do it but not my local nuclear reactor. They seem to want nuclear waste on our highways.",
    "Is this satire? ",
    "AFAIK, anything radioactive for hundreds of thousands of years isn't that radioactive.",
    "They said the same thing about wood, then coal, then crude oil... there's plenty of it.... right??",
    "Y  O  U  HAVE .!. You just don't\n................. ........... know it  Dear\n\n    just \"*wait*\" .",
    "The Frinchies may be annoying as f@&$ but they ain’t stupid.",
    "Because people already established themselves as nuclear waste disposers.",
    "I'm sorry... it's too EXPENSIVE? A) you have less radioactive waste to store (making it cheaper by far in the long run) and B) you have a greater lifespan of your fuel supply. Why is hell is that not automatically worth the initial investment?",
    "It’s not a price problem. It’s political. The hidden costs of using fossil fuels is far higher than nuclear. BUT then billionaires would have to give up their yachts and private jets which we know our governments won’t do unless we force them to do so.",
    "Playing fallout and hearing them talk about the “resource war” and thinking dang weird how that’s turning out more nukes then people in a couple hundred years ",
    "My understanding is that why it is not recyled is potical. It's political because the byproduct of recycling the used rods is weapons grade plutonium.",
    "Just make it into Plutonium and put it into an Awesome Sink.\nNot that hard people, not that hard. ",
    "no",
    "crooks",
    "The French accent is atrocious",
    "Because the fossil fuel industry can’t profit off of infinite energy sources. Capitalism only innovates on pricing models, and it thrives when you are trapped into paying them rather than getting a good product. Things in society are going to have to get much worse before anyone is willing to tackle that beast.",
    "Great video. Can you do one on Thorium reactors? Or other future or near-future tech to produce energy. \n\nA bit more about the political aspects could be of interest to a lot of ppl too.",
    "Because of their efficiency, molten salt reactors could be set up to burn nuclear waste.  It's been found that if enough MSRs were built to supply the current requirements in the US, MSRs could run for 350 years, burning up the nuclear waste.",
    "8:21 that's the crux of indian diplomacy ...",
    "It’s like gluten, just figure out how to put it back into the food system as some byproduct. Hey, it’s gud for you!",
    "Another lie. Russia is the leading country in nuclear energy agreements.",
    "In Russia we are doing it.",
    "France!? Recycling nuclear waste!?\nCheck the north atlantic sea floor for millions of tonnes of waste!!!!!",
    "\"Ferb, I know what we're going to do today\"",
    "First, the reactors are wrong. Salt solution reactors have an efficiency of 95%\nSecond, the fuel is wrong. Uranium only lasts a couple of 100 years. Thorium lasts 10,000years and is much cheaper.\nThird, the oil industry doesn't want this kind of reactor; it would destroy their business completely.\nSo they got the money and stopped all the funding by all means necessary.\nWithout money, no reactor.\nNikola Tesla died poor, not from lack of knowledge, but from lack of funding. There is no cheap energy. It has to be expensive.\nAccordingly to the people who have the money.",
    "A Molten Salt Reactor (MSR)can be fueled with a mixture of Uranium and Thorium.  The inventor of both types of reactor was Alvin Wineberg.  The MSR can burn 98% of the fuel rather than 2٪.  Properly operated, MSR's don't produce Plutonium bomb material.\nSo why has the MSR type been abandoned?   Oak Ridge was the site of the research reactor.",
    "can't give rosatom more money.",
    "It is too expensive if you have to build the entire infrastructure first\nThe lead that fossil fuels have in this respect is ridiculously large. There is no way to catch up, except to give up this part completely, as can be done with renewable energies\nAnd even then, it's an extremely unfair uphill fight politically wise \n\nbesides all the problems of long term investment in critically unstable times. Tackle one problem, and the next government will tear it to pieces, and (which isn't a bad thing per se) technology is advancing so rapidly that any mega-project that is built will be obsolete and worthless before it is even completed",
    "The most dangerous governments already have nuclear weapons. Together they form the NATO mafia. Nuclear power is the biggest mistake human beings have ever made and we keep making it. In fact there seems to be a movement promoting more. Good luck to their grandkids",
    "Almost everything except glass, aluminim, and other metals is cheaper to make new, hence why we have recyclABLES filling landfills and floating in the ocean.",
    "What is the half-life of the vitrified fission products in storage? Reportedly, the fission products deriving from a LFTR style reactor have a half-life of 30 years.",
    "Driving it across the country in secret trucks...they're using the Manhattan Project strategy.",
    "The answer is 4th gen nuclear reactors, like fast breeder reactors and molten salt reactors. China and Russia have 4th gen reactors in operation already. They can use >97% of the available energy in nuclear fuel, leaving only tiny amounts of waste with a half-life of a few hundred years, in so also solving the storage problem. With these reactors, no new fuel is needed as they can run on spent fuel rods for hundreds of years into the future.",
    "If there's something that is reusable but isn't being reused it's because of money and profit for the ruling class.",
    "A lot of misinformation fear mongering here. Not all plutonium is the big boom kind lol",
    "Because we have morons in power, lawyers and politicians.",
    "The graveyard will ONLY hold so many dead then it will be full.",
    "I will answer your question in a very simple statement radioactive waste, particularly spent fuel rods is used in weapons grade plutonium United States no longer makes plutonium pits for the nuclear warheads. Thus having an over abundance of nuclear waste I don’t understand how people can be this dumb.",
    "FOLLOW....THE.....MONEY!!!",
    "We need to start thinking radio active is not a emergency trougth health patch by amend need on how the primal material on use need to confine.",
    "We need more people talking about this, and reminding politicians of this",
    "F*ance",
    "The obnoxious music made it really hard to follow this video. It's competing with the speakers for understandability. It also adds no value, it's something added purely to the detriment of the video, and the video overall would be much improved had no music been added at all.",
    "i wonder how how much of the extractable materials from spent rods can legitimately be used in other industries",
    "Why?\n\nBecause hippies are stupid and governments are corrupt. They don't want technological advancement unless it increases their power and authority.",
    "and if it escapes we will have a zombie apocalypse problem",
    "Free energy forever, they said.",
    "It's not done because it costs money. It's not profitable. If its not profitable, why do it?",
    "\"I never been so close to radiactiv waste\" ....",
    "4:36 If it takes so long to cool the rods, there must be a heck of a lot of heat in them; why doesn’t the water boil in that time?\n12:12 Recycling is “too expensive” for the UK, which has billions to spend on hotel rooms for “migrants”.",
    "How she reacts to being close to spent nuclear fuel and how they portray all types of radioactive waste as similar and equally challenging (in the beginning) illustrates the level of missinformation people been told around this subject.",
    "Somply put Nixon is to blame.   He made the decision to go with the GE reactor because he needed Carolina and southern states votes. He could have gone with the salt reactor it was safer cleaner and made 1millionth the waste and even that waste had a half life of a generation not thousands of generations even better the duel could not be converted for weapons but that bastard picked GE and packed the energy commission with GE people so the salt reactor would never have a chance. We could have sold the salt reactors to our enemies and friends alike. It would have saved hundreds of millions of acres of forest,fresh water lakes the, pacific ocean our food supplies literally everything would be cleaner now, safer now.",
    "I would think the reason would be the same as normal recycling the cost doesn't make profit so why bother.",
    "France really couldn’t put that plant any closer to Britain if they tried lol. Fucking french!",
    "just a wild guess, is it because its cheaper to make new rods??? or cheaper not to research how to reuse them",
    "You first.   Nuclear\n\"something\"  and diamonds as betteries for  cars.\nLast for years, the diamonds adsorb \nnuke rays.  \nSearch for it.",
    "So It's cost efective.",
    "The waste is a huge problem!",
    "this is madness, we need new tech for clean energy. Nuclear energy feels like, taking bank loans without any job to built a mansion.",
    "France needs Nuclear AI. and more uranium .",
    "Yes politics stopped the reuse. It is a pro argument for nuclear power. The radioactive mess caused by the recycling process was epic - the separation process left extremely problematic liquids of no further use, a point  ignored be the advocates of reuse. Badly contaminated places in the sea at the  locations of hideous disposal of the acid liquids  - La Hague - Sellafield  - no future, just a criminal mess. Forget nuclear power its naturally  a endless mess by dimension and time regardless technology. Its as great as  fossil energies. Both kill us in the long run. Mankind is doomed in its ignorance and ability to waste and destroy.",
    "“The release of atomic power has changed everything except our way of thinking.” Albert Einstein.",
    "Kind of off topic, but Nikola Tesla knew how to get electricity from the ground and the atmosphere. Only his funding being cut, by the investors who profited from the selling of electricity, stopped us having electricity \"on tap\". \n\nNuclear fission was studied for the creation of the nuclear bomb. Power stations were a front to create fissionable metal for warfare. They never gave any consideration to what to do with the spent fuel. They just buried it for some poor person to find in a few hundred years. \n\nBillions spent on developing it, £9 spent on a shovel ",
    "We are called class 3 and 4 nuclear",
    "Summary: Nuclear waste turns to stronger biproducts. Can be used for nuclear weapons and other harm.",
    "A big part of the problem is our choice to use thermal nuclear instead of fast nuclear.",
    "No  Nnclear  power plant has paid for itself or lower electricity bills without a large government subsidy",
    "While it is possible to handlle a NEW Uranium oxide pellet because human skin  gives some protect against Alpha particles, USED or spent nuclear power plant fuel rods are EXTREMELY dangerous, if improperly handled. If one is for some reason out in the open, and you walk up to it and take a close look at it for thirty seconds or even less time, you will be dead from radiation poisoning in a few days. There will be NO HOPE for you.  The half life of u234 is about 704 million years. Not a nice legacy to leave  to future generations especially if we forget where we put it.",
    "If you were to add the cost of recycling to the business case for Nuclear power, the case does not add. Thorium can expoit spent fuel rods but you still have aresidue that you still need to safe store for 100,000 years.",
    "Imagine one day a severe earthquake to that storage location. And then what will happen only God knows. ",
    "All garbage is completely recyclable. The issue is cost versus using new.",
    "This documentary is a 100% lie. Areva exports 90% of this uran-235 to russia tomsk-7. Look arte documentary 2010 alptraum atommüll.",
    "Just burn the coal till fusion comes on line.",
    "MONEY, that is why",
    "How expensive is it to recycle so called nuclear waste seems like it will a lot better for the environment to recycle it instead of mining",
    "MSRs are the way to generate energy and burn waste fuels.",
    "Presenter looks A LOT like Molly Tuttle.",
    "No but, Tucker sez its very easy and carefree: just barrel the waste up and stuff it in a mountain for future generations to worry about. Simple. .",
    "It’s safe for countries who have such a good expert knowledge such as France \nSafe to say world leading experts \nI think this will be the worlds future energy.\nFuture energy solution ",
    "That’s because the U.S. has allergy to recycling. If you’re going to use nuclear this is the best and only way it should be used. The French aren’t stupid. The U.S. is so wasteful and dangerous.",
    "China made the French to teach them how to make clear power plants… so they can make nukes … it was on the news that China power plan always not up to standard … and leaks ",
    "THIS IS S A STUPID THING TO DO!",
    "No its not.",
    "I remember i saw a piece years ago w/ a guy who was working on perfecting a process to eliminate radioactive waste through a type of steam pulverizing of the waste material ? I would love to see a more detailed analysis of cost comparison especially looking at what was spent by other countries to create same amount of energy compared to what  FRANCE spent but then gained the profit long term by owning this more efficient system - since energy is such a critical expenditure for running an economy = if its a state owned facility i would think there's an intrinsic savings and profit of owning these facilities ( including minimizing risk and gauranteeing future supply ?) = would'nt that neutralize cost as well by calculatable profit of stable supply ?",
    "It is all about PROFITS.  When someone finds a way to economically recycle the fuel, it will be done.",
    "That part at 2:45 Instant goosebumps",
    "Um no this is how radium of just dump it in the water .do not do this.",
    "That's why humanity needs Fusion technologies.",
    "What is fission product? Did they trap neutrons in the glass?",
    "Nerdy girls are so hot",
    "The only reason we use uranium is that the governments want weapons of mass destruction. Thorium is safer to use, and the waste is nontoxic.\n\nThe devil runs the governments of the world.",
    "Another fact is that it takes 308 years for the human body to break down vegetable sead oil because we dont have the correct enzymes.\n\nEvery drop we eat is stored in our fat cells until they break down like plastic. Number one reason for obesity today.  Starving to death on a full stomach.",
    "Bill Gates has a waste sight near St. Louis.",
    "Waste creates billions in storage fees which corrupt governments pay to their corrupt political sponsors for ongoing storage.  Nuclear waste can be readily recycled & even neutralized, but you won't find those solutions mentioned in propaganda videos like this one.",
    "  Holland .    ",
    "Molten Salt is the key to reuse current nuclear waste. China is the leader and not France.",
    "fuck nuclear energy",
    "Hey DW before making any nuclear related videos just make sure to start within your country oh but it is too late because your guys shut down all the nuclear power stations in your country and you were advocating it, now you have more carbon emissions ",
    "Nuclear energy is total bs in nost countries.  Hydrolelectric dams have no fuel. You dont need to mine anything, theres no toxic waste.  And several dams can be placed along the same water source that can last hundreds of years.  The only reason north america pushes nuclear so hard is because they want cheap enriched uranium for bombs.",
    "West Valley,NY reprocessing facility AEC ....\nClosed in 1960s .",
    "1:04 so if some one try to destri the world, need destroi only 1 thing?.... i knew about frogs and smells.. but are you joking?",
    "maybe nuclear energy  is a deadend. because this nuclear waste is just getting bigger and bigger in size. and its lethally dangerous.\nmaybe people should use a wind energy instead. along with a solar power energy! ",
    "All that to charge my android phone",
    "To make a bomb weapons  grade is necessary. The obtained plutonium  from  fission reactors is NOT of weapons grade.\nThe Soviets did not know and built the RBMK anyhow , a kind of copy of a converter reactor ,\nThe idea is not totally wrong as graphite is used as a moderator and less U235 is needed in the fuel.\nBut the safety issues are as you know terrible.\nJournalists are mostly communist affected and lied from the start as they got their information from Soviet KGB.\nThere are other reactors much more efficient and safe, but Big Oil does not like them and stopped development 1970.",
    "Since when does steel stop gamma particles",
    "MOLTEN SALT FAST BREADER reactors burn nuclear waste. But it is not mentioned because only one country has 3 of them operational. Country that narative forbids from being mentioned as advanced.",
    "Incredible",
    "The steam coming out of those smokestacks is water steam not waste its watersteam just like u boiling water NOT radio active at all!!",
    "Because the nuclear energy is dangerous to the environment found in the wallet of green energy corporations.",
    "I’ve had the pleasure of visiting Orano La Hague. It was extremely interesting !",
    "11:08 yeah sure, few downsides, but respect to the Frenchies and whomever else recycles it like this. When you think of wealthy nations, France likely wouldn't be in the top 5 of most peoples' guesses, yet France are doing better. If France can do this, then the States, Arab Emirates and so on should be able to do this easily. No pathetic excuses.",
    "But what about green goo in yellow barrels?",
    "Who is we",
    "US Acts holier than thou, Bastards want to keep their own nuclear weapons while asking others to not develop nor keep. World isn't chutiya like them.",
    "5:20 it’s actually the splitting of the NUCLEUS of the atom - Electrons aren’t involved",
    "When our fossils are studied by future aliens they will detetmine we became intsantly EXTINCT after enviroment RAPIDLY heated from release copious deadly radiation. 100 years of open bomb testing .",
    "Informative.",
    "Imagine now a fuking army ocupaing  this facility....and rusians..",
    "There should be no reason why some parts of the world is left dark on purpose because man can make more power to supply the whole earth.",
    "Thank you for finding the right level of simplification to keep the video informative and engaging without going to deep into the details.  Well done!",
    "US was so terrified they gave some nuclear weapons to Pakistan , diabolical white syndrome",
    "Hahaha it’s not profitable so they will turn you down",
    "Please translate in Hindi language",
    "India\n\nActively reprocesses spent fuel at Tarapur, Kalpakkam, and Bhabha Atomic Research Centre (BARC).\n\nUses the extracted plutonium in fast breeder reactors.\n\nIntegral to India's three-stage nuclear power program.",
    "Capitalism. Or, more likely, Politics as dictated by Capitalism.",
    "It only took a stupid doritos to change everything...",
    "what i don't get is why Eco nuts cant understand, where do you think the nuclear material originally comes from? the earth, so why is returning it to the earth from where it came from such an issue? Give me a brake.",
    "We've had the tech since the 1970s. Politics, misinformed public and OPEC...blame that. The US would've been totally energy independent from the world....greedy bastards.....",
    "Its funny how Germany who used to fear monger about nuclear energy, with just one man Putin coming, is now trying to reverse that out\n\nExample of how sometimes dictators can change the world for good ",
    "that white suit looks way better than the beige one I had to wear for the SAT.1 TV company back in 2007.",
    "Nothing can beat the good old ways of natures recycling. At the moment recycling prett much is a scam",
    "Tres intéressant ",
    "You said the cost of virgin materials is cheaper than recycling. Does the cost of virgin materials include the cost of pollution and environmental damages from strip mining those virgin materials?",
    "In regards to governmental corporate ideology, logic has no place in it. In all corporate endeavors, it all about profiting and poisoning.",
    "The US Navy recycles their fuel rods at INEL in Idaho Falls. They shred the control rods and scoop out the uranium fuel to refine and reuse.",
    "Usa terrified cause another countries (india) are capable of developing nuclear energy by there own then they started sanctioning india and after that they started importing all the great mind from india to usaa cheap country cheap mindset.",
    "you'd only have to store  it for like 100 years, not \"hundreds of thousands of years\"",
    "More lies from the Power junkies & we all know junkies always lie & want more",
    "Ironically the biggest opposition for nuclear energy are the anti -fossil fuel crowd.",
    "New fuel is cheaper and people/governments are paranoid about nuclear proliferation.\n\nThe first issue has several solutions: store all the spent fuel until new fuel becomes more expensive than reprocessing (so the spent fuel is a valuable long-term investment), subsidize reprocessing to effectively mandate all spent fuel is reprocessed, or switch to fast-breeder reactor designs configured with molten salt reactors with continuous reprocessing of the fuel matrix. (the latter has the problem of maximum nuclear proliferation paranoia, albeit somewhat less so for hypothetical thorium-uranium cycle reactors instead of uranium-plutonium)\n\nFrance is the only country in the world to use the section option (mandate reprocessing and heavily subsidize it). This approach also makes it more economical and much, much more strategically secure (full self sufficiency, no reliance or dependency on importing fuel from Uranium-rich countries), even if it still costs somewhat more than buying new fuel. France did it both because of their nuclear weapons program and for national security power interests. (they way they managed their nuclear power plant construction program is also exceptional given the tight regulation, high degree of standardization, and resulting safety records)\n\n\nOf course, the real problem is that most of the mismanaged waste isn't unprocessed spent fuel, but large volumes of contaminated material that need to be processed, treated, condensed, and then disposed of properly (for any remaining residue). That's the kind of stuff that's supposed to be in the iconic yellow barrels. (though given the gross corruption and mismanagement ... and lack of proper oversight, that led to the sort of dumping in the case of the German salt mine ... I wouldn't want to bet on the levels of contamination for some of that stuff)\n\nSpent fuel itself is generally too valueable to store as simple waste, even if it's not valueable enough to fully  reprocess (yet), but worth keeping around as a useful raw material. Plus you have to let it sit for years before it's safe to reprocess, anyway. But, from the reprocessing also comes the extraction of the fission product, particularly the medium-term (ie decades to hundreds of years) isotopes like Strontium 90 and Cesium 137. Those can be rendered chemically inert by dissolving into glass (forming silicates, given both of those have many, many soluble salts, especially Cesium, like all alkali metals) and going to a long term geologic repository (there's a tiny amount relative to the power produced, so this isn't a big deal ... as long as you have remotely sane regulation, and any sort of sane long-term planning, from a business perspective, too, since improper dumping is never good for long-term profits ... it just depends how long term you think)\n\nBut, even with the fission products, there's valueable use of them as well, and potential for nuclear-thermal generators of various types ... just don't distribute them throughout the wilderness and then abandon them like the Soviets did. (more realistically, they could be used as secondary generator fuel on-site with some power plant models ... and all sorts of waste processing is better to do on-site as much as possible as well, both for security/risk reasons, and sheer cost effectiveness)\n\nFast reactors also burn up a small portion of fission products due to the high neutron flux (or the side effects of high neutron flux), and fast-breeder reactors tackle that while also extending the refueling cycle dramatically. (assuming all bred fuel is intended for power generation with no reprocessing into weapons material, the fuel cycle can be much longer, or indefinite in a molten salt reactor, since the molten salt fuel matrix can be continually reprocessed during operation) But the most promising of these types are still experimental for the most part, and there hasn't been enough public interest, support, or funding to really make them a reality. (so the safest, best tested, most reliable designs are mostly derivatives of conventional tried and true light water reactors, many descending from the already mature designs the French licensed from the US in the first place)",
    "It’s been a year! Any update???",
    "A single one gram of Po is similar to 1 metric ton of oil. That's incredible. I know how amazing displacing oil with nuclear fuel is but that's unbelievable.",
    "Why is it transported here?",
    "Cuz it'll prolly end up in our food supply",
    "Because it is so easy to make a nuclear bomb.",
    "My wish is.. No waste in the future and therefore complete restauration of the nucliaer enengy problem that began to excist since Worldwar 2. Maybe Fusion is the sollution, but it takes so much time.. Ukraine is defending France's inventions and ambitions as a fact. So why doesn't the world do more to protect Ukraine? And why do people still throw away garbage like cigarette filters on the street or in the green surroundings or nature? Those are a real problem, since they mow over the garbage... at least in the Netherlands. Something has to change! Maybe war is the sollution.. Less people less problems? Still I have the hope for a family of my own. I only threw one bit of rubble in Nature in my life.. And I appologised for it later in life. Maybe that is an idea for people who have done a bad habbit.. To at least appologize to the people who want to help to solve the problem..",
    "Where is us",
    "When can i power my home with this? If Batman can do it...",
    "We need more nuclear!",
    "And now think about, in what other areas have people believed and are still pushing ideologies that sound like they are saving the planet, while in reality it’s all about them feeling like a good person",
    "The general answer to the question of \"Why are we doing A rather than B?\" is that A is cheaper to do than B.",
    "5 to 7 years in the pool\n damn how hot do they get",
    "I think people discover uranium know that its harmfull, but in industrial age they dont want to lose money, so the problem will be dealt by the future generation while they keep earning.",
    "The majority of nuclear waste is low level and not recyclable. Covers, clothes, overboots, protective casings. It’s just radioactive enough to be a concern but also bulky",
    "It's about trust and safety. Losing your hair isn't cool.",
    "Cost shouldn't be a factor.  Burying it isn't the answer.",
    "Not surprised to see that USA is not called upon even once.",
    "2:04 How is this safe??? Wouldn't the fuel rods still emitting bunch of neutrons that can't be stopped by steel easily?",
    "This is tech that made greta irrelevant",
    "this is wrong at so many levels. i dont support it at all, unless they find 100% recyclable method otherwise its gonna cost humanity. 1 natural disaster, or 1 war escalation and boom that underground facility is gone. if more than 30 countries are using this techno. then means 30 underground facilities. very very very dangerous , even this 4% unrecycled is hella alarming, storing them underground is brushing them under carpet. unless, that technique is fully discovered Pyroprocessing or MSRs. even then i dont endorse it at all one disaster and most painful death.",
    "Good old boy program. A friend of the guy who owns the plant. Ships the waste to a friend who owns the disposal company. They both make millions. ",
    "Russia throw their Nuke waist in the ocean. An d all over the terrotory",
    "why use the word trash,  its not it is a byproduct or waste/",
    "A lot of that nuclear waste can be turned into top end cancer fighting meds!\nConsiderably more useful than coal just shitting carbon dioxide into the skies and not taking any responsibility for it. The nuclear waste, you can put it somewhere specific and it stays there, if done correctly. Not like the lead in leaded gasoline which is all over the surface of the earth now. \nIt's a bit sad phones and tv's and monitors so high tech, and it's still coal = electricity. Plus it might still be that way the next 50 years if we don't haul ass to get more non-coal electricity sources.",
    "Where is USA",
    "She must be crazy",
    "Siemens already invented Clean Nuclear Power Generation in the eighties. But President Carter banned it !\nClean means the nuclear fuel can be used again and again until it is completely used up. So safe you can hold it on  your bare hands !",
    "Democrats.",
    "8:15 It's really astonishing that how all these brilliant ideas come from Indian minds. No wonder why NASA is filled with so many Indians.",
    "If recycling nuclear waste for power production is not cost effective then it should be government subsidized since it benefits everyone.",
    "Spent fuel rods can fuel Molten Salt Reactors and eliminate the need to store spent fuel rods for hundreds of thousands years. #MoltenSaltReactors are the solution.",
    "It's all the green energy idiots that actually believe it's a viable alternative for our energy needs. Nuclear energy is the answer, at least for the next 100 years, until we come up with something better.",
    "it was because lots of our human beings ..... cannot understand in accure of polutions & disasters , nowadays ,  maybe with a wait of security dispose does .  ",
    "we dont want cheap energy... we want energy we can make money on.. free energy is way too free",
    "14:47 uranium never reached the cost to justify the mox reprocessing. Uk France and Japan should have just used 1 country for this.",
    "Not tens of thousands of years ",
    "Well here in Australia our politicians can't even have a mature debate about Nuclear Power so we'll just pretend it doesn't exist, and spend 3 times as much on solar and wind every 15 years......oh well!",
    "Because a lot of rich people (Not from the Nuclear industry) prefers to keep energy coming from fossil fuels. And that rich people have other rich/powerful/influential friends.\n\nSo no rush when it comes to \"Recycle\" since makes more money single use stuff. Guys cmon, try to keep up.",
    "The technology exists for free energy. Only the rich power mongers block its progress. Even with murder of inventors.",
    "Follow the India's thorium model. The nuclear waste produced is very less is dangerous for about 100 yrs only. Its expensive and complicated but it's the way ahead and compared to petrol on cost to cost its still dort cheap and most importantly the environmental footprint is much much lower",
    "Why didn’t you talk about fast breeder reactors that use nuclear waste AS FUEL?!\nFast breeder reactors are a proven technology decades old!\nFrance ran breeder reactors for decades.",
    "You can turn and twist it any way you want: they are still leaving radiocative residues that will have to be kept safe for 300 generations. That means assuming that for the next 10,000 years, there will be a minimum level of civil peace, and no civilizational breaking points.\nI do not believe that is possible, our past Human History is my witness....\nEspecially not if two nations are at war, one gets desperate, and targets the others nuclear plants.\nFrance's EDF and ORANO are government-owned: no private company would want to do it, as it's prohibitively expensive.\n\nNowadays, we have a much cheaper source of energy, and totally safe: solar+wind, with backup from hydro+batteries+many other storage technologies under development.",
    "They aren't recycling coffee cups but we are supposed to believe they are going to recycle nuclear waste.",
    "ALL THAT HALFLIFE COULD BE DILUTED TO ENDLESS BATTERIES!",
    "Why? Retreating make more nuclear garbage.... Dry storage make zero more garbage and still the retreatment can be done later",
    "6:40",
    "2:37 thank god there’s not jet fuel in there",
    "despite France having (one of) the higwest use of nuclear energy we don't have any easy access to the raw stuff \nso yhea recyclying very important",
    "Please cover a video on India’s 3 stage nuclear programme that seeks to solve this problem - \nIt uses nuclear waste from the 1st stage as fuel in the 2nd stage (fast breeder reactor) which produces more fuel than it utilises - which in turn is used in the 3rd stage along with thorium (which is more energy dense than uranium and produces less waste)",
    "maturing is realizing that the government is stupid, and even if I KNOW the right answer to fix somehting. Nothing will ever get done",
    "You don't understand exponential functions.",
    "11:34 USA entered the chat",
    "It’s irrelevant, accidents happen. You don’t get a second chance when they do.\n\nBetter ways need to be found to power the world without the risk of accident or waste piling up as it’s not cost effective to use it",
    "Jimmy Carter's fault.",
    "I dont know why they dont do it, but im sure is because is more expensive than buying more uranium fuel. Ecological concerns are secondary",
    "NO U CANT.",
    "What are the crops growing in the fields right next to the plant",
    "Just while they are dirt stupid!!!!",
    "She keeps confusing the terms \"nuclear waste\" and \"spent fuel\". Waste is a rubber glove, paper Tyvek suit, tools etc. used inside a hot area. Despite not being dangerously radioactive it is \"nuclear waste.\" Spent fuel is just what it says and is a very small fraction of the \"waste\" content.",
    "im wondering why is nuclear fuel demonized so much. when theres already proven methods of safer and better fuel effiency. its always about the money greedy rich Idiots.",
    "As there is plenty of raw nuclear resources, why can't nuclear waste be sent to the sun? would those cost really be more than recycling? What is the method of generating electricity directly from nuclear waste? (as in batteries)",
    "7:52 WTF is a metric ton? I've used ton for all my life.  I've never heard anyone using a non-metric ton.  The \"metric-ton\" is something weird americans use.  So why is DW saying metric ton? Are europeans starting to forget how the metric system works?  Can I say metric-celsius or metric-gram as well?  Why are you being weird?",
    "Sigh this stuff in the berrals is all the stuff associated with handling and containment equipment it's contaminated with radioactive particles. The fuel itself usualy gets stored. It's way more expensive and dangerous to recycle the pellets expand and fuse with the containment tube.so you need acid",
    "When you take into account what mining virgin nuclear fuel does to the environment and up, it should be considered paired side by side with reprocessing. \nThere are also other fuel types like Thorium that need to be fully researched and viability established or not with inherent risks for long term storage issues.",
    "Reprocessing nuclear spent fuel is a proliferation no-no. The US wouldn't allow most of its vassals to do it.",
    "Do you also produce reports as part of these inquiries?",
    "Gee...wouldn't it be great if we could actually turn all this nuclear \"waste\" into something usable energy without a hole lot of handling? Thorium Molten Salt Reactors can do this. It can accept not only U-233, but also U-235, U-238, Pu-239. MSR's will have a \"kidney\" like set of devices that will chemically separate what is needed from what is not needed. An example, if U-238 is allowed to circulate around a reaction vessel where an additional neutron can be added, it can become U-239, which half of will turn to Pu-239 in about 3 days half.  The ability for a MSR to set aside U-239 just as it will do to Thorium-233 to convert to Pa-233 then to U-233 will allow these reactors to accept U-238, convert it to U-239 eventually becoming Pu-239 which is fissile. \n\nDid you know that the EPA does not allow Uranium miners to return the U-238 waste to the mines where it was extracted? With a Th-MSR, it can now use the U-238 as well to produce electricity. So instead of using only 0.7% of uranium that is U-235, we can now use U-238 which we have in abundance. \n\nWhat's stopping all of us? Ask the NRC...bureaucrat scaredy-cat regulators.",
    "9:59, you know what else is?",
    "Cool project for me if so no need for i have أهرامات \nClean energy",
    "Can somebody please say something about NECSA in South Africa, for educational purposes of course ",
    "The rhetoric for decades was “we can’t use it and it’ll be there for all eternity” so people settled on that. Especially the idea that “what is now will always be” and people always do that no matter what year it is. But I think the funny thing is how naive everyone is and how when humans advance we will learn more. It takes time. Imagine someday, beyond even your great grand children’s lives maybe, they go and dig up all the waste and have a use for it.",
    "Trash and waste dont exist. Trashy and wasteful people exist.",
    "Due to a plutonium shortage Nasa has holed off on some projects because they dont have enough to use in there r.t.g (Radioisotope thermoelectric generator) this would be great to get fuel for reactors and restart some projects that Nasa wants to do.",
    "Because we dont want cancer ...",
    "It’s nice that France thinks they won’t have a national security threat detection capability for when they are invaded by royal armed forces",
    "Youd think they would keep it because plutonium and uranium is pretty expensive and we do not have a surplus of plutonium.",
    "Just sent those waste grounded below the floor to the outer space targeted to Sun.",
    "Research and development is very important but costly!",
    "Very different to Chernobyl",
    "fusa",
    "Yes, but chemical reprocessing is expensive and produces more highly toxic chemical waste! A much smarter approach is to use integral fast reactors like the ones Russia is using (BN-600 and BN-800). One, designed as a \"fast breeder\" uses spent fuel elements (U238) to breed new fuel for it self and pressurized water reactors; the other, designed as a \"fast burner\" uses high-purity weapons-grade plutonium from nuclear disarmament/modernization (or the 239pu from fast breeder)... and both are running during commercial electricity and energy production! Germany could have had an isotope economy with a closed nuclear fuel cycle (NFC) long ago with the Kalkar nuclear power plant, but unfortunately, the operational nuclear power plant never went online due to political concerns. \n\nThe principle of breeding is not really new, as it was already 2 billion years ago at the natural nuclear reactors in Oklo.",
    "France has had 100's of nuclear \"incidents\" since they started using nuclear ... one incident required evacuating people from 3 towns",
    "The nuclear storage \"casks\" are not even lasting HALF their expected storage life",
    "France is REDUCING the % of power they generate from Nuclear ... and Germany too",
    "Nuclear is THE MOST expensive way to generate power ... and the most IMMORAL",
    "Acqua di scarico dei reattivi  alimenta la centrale termica del c.t.o collegata con la centrale idroelettrica che con la sua radioattività attiva i macchinari  con chip di IA che richiede molta energia. Vorrei sbagliarmi ma il sospetto è sempre mezza verità",
    "Yes pu is used for war however Pu is more useful in RTG.",
    "Petroleum industry will have a hard time with this idea of using an alternative energy source.  I expect a string of funded studies to come out to reinforce the rhetoric of how dangerous nuclear energy is.",
    "You missed most important part..that fast reactor comes into picture if u recycle.. it reduces the half life by huge.. means it reduces half life by 1000s of years..",
    "Give me a good excuse why we're not recycling spent fuel rods?",
    "If that spent fuel is still over 200C-300C why not use it to make steam and then power? while you wait for it to chill out and cool down?",
    "lobby, russia, corruption",
    "It would seem that using fossil fuels is the safest and most earth-friendly fuel overall because the planet has existing biological and environmental systems in-place to process the byproducts. It would seem that bolstering existing natural systems to process the byproducts would be a better choice. The further we get away from natural systems, the more problems seem to be created.  As carbon dioxide is released, the earth gets warmer, more rain should fall, more vegetation should grow, more oxygen should be created, and the planet should regulate itself. It seems that we should choose to live within the limits that the earth allows.",
    "1st time here, subbed",
    "Because no one wants an extra pair of limbs growing out of them",
    "They should spend the time and money on bettering solar tech and batteries, we have a nuclear reactor in the sky",
    "Interesting video. The You Tube channel 'The Proper People' recently explored the now abandoned early 1980's Barnwell nuclear recycling plant in America (March 2025 video), and this recycling centre looks virtually identical, event the interior layout looks almost identical to Bramwell!!! So its interesting to compare a fully operational plant vs a decommissioned one, and see all the areas you would never normally get to see if it was working!!!!",
    "These two obviously have children already.  I would be freaking out if i hadn't had kids yet. You couldn't get me within a mile of this place. Hahahahahahaha",
    "Why? Because of policy. We don't want to mess with plutonium. France does. Is it better? probably, but there is a risk of someone capturing enough to make a dirty bomb.",
    "Nuclear waste, especially high-level waste, remains radioactive and dangerous for thousands of years. Even low-level radioactive waste (like contaminated gloves or filters) must be safely contained, not reused for consumer products.",
    "It's simple: reprocessing waste gives you free Pu.  Pu can be used to make (mediocre) bombs even if not further refined. That creates a nuclear weapon proliferation problem.\nIf spent fuel reprocessing became standard, then there is a very real risk every country with a civil reactor problem would have nuclear weapons. That is undesirable.",
    "I would support nuclear is they recycled the fuel and had a final solution for the remaining waste. The storage would need to be able to store the waste until safe.",
    "If you used all that money invested in the recycling plants and nuclear plants and invested it in wind, wave alternatives would we bé able to produce enough electricity ?",
    "The energy from nuclear plant is already the most expensive and there is even not account the risk of a total meltdown. As You have seen in the video the used material is mostly not recycled because of the high cost. The electricity from wind power generators and pv systems are today cheapest and the price is still going down. It is no-brainer, which technology has future. There is only one reason to use nuclear plant: To build atom bomb and use nuclear submarines.",
    "The deepest hole ever drilled in the world (by Russia) sounds like a good place to dump radioactive waste.",
    "We're not using it because of environmentalists. That's why. \n\nThanks hippys",
    "Is it waste of anyone who i know?",
    "Is it waste of anyone who i know?",
    "Just melt down those old fuel rods into a molten salt nuclear reactor and use up that fuel energy that way.",
    "At the end of the world there will be lights on in France",
    "What about thorium?",
    "Klassisches Greenwashing.  Als ob man verstrahlten Stahl und Müll aufbereiten kann..\nSolange der Steuerzahler die Kosten trägt ist alles super.",
    "You didn't steal the french company that does that? Ask Ursula she'll give it to you",
    "At the conclusion of the video, there was no mention of the developments in Thorium reactors. Just a false comment that there is no better solution.... and a redirect to \"the price problem\".... ANOTHER CHEAPER BETTER TECHNOLOGY HAS COME AROUND.",
    "spent fuel from Australia??",
    "You guys really should mention other reactor types like breeder reactors which will can reduce waste and almost eliminate the need to recycle. Reactors like Natura liquid fuel reactor has something like 90%+ fuel utilization, using less fuel and can remove fission products in continuously without needing to shut down the reactor. You could also just use throium instead of uranium and avoid the plutonium problem altogether.",
    "Hello! I’m a 14-year-old from South Korea.\n\nI really enjoyed this video—it was very informative! Since I’m not fluent in English, I watched it using auto-translated subtitles. I hope that as this channel grows, it will offer subtitles in more languages so more people can learn from these great videos.\n\nIn South Korea, we currently store nuclear waste because we are not allowed to reprocess it due to the Korea-U.S. Nuclear Agreement. I hope that one day, Korea will be able to develop reprocessing technology and expand nuclear energy, collaborating with other countries to improve this technology even further.\n\nThank you for making such an educational video! Keep up the great work!",
    "Simple, the problem are oil companies like SaudiAramco are lobbying governments and framing nuclear energy as dangerous and unsafe.",
    "neat documentary, giving an update on this sticky problem of nuclear waste. DW - thanks for producing and sharing it!",
    "I want to see the whole recycling video",
    "US stocks their waste for future use. Why would we recycle  it when we can use up the world’s supply.",
    "Maybe a dumb question, but how much waste is produced in relation to the raw material?",
    "They can use depleted uranium as bullets because it’s very dense and hard.",
    "I pray to god this world can come together one day and find other uses for nuclear weapons instead of waiting for an impulsive use for mass destruction",
    "Capitalism",
    "I feel like it's not exactly helpful to constantly show nuclear explosions when talking about plutonium.",
    "Just put it in a pipe and smoke it.",
    "Why aren't we doing it? Energy lobiest.",
    "Consolidation of nuclear waste might be an issue if this technology seeps into everyday items. Rather than power plants where it can be securely maintained. Technology limitations ofcourse.",
    "Instead of individual countries researching this, more countries (especially those that lead in technology) should collectively research a better recycling process (for fission products, too) and waste storage, a separate organization like we have WHO in the healthcare sector. This could significantly improve the pace of the research & studies. Later, when they find a new & better solution, it could be implemented in several countries across the world. Because Life & Humanity are more prior than money and also 'There is strength in numbers'.",
    "Thank you for share ; I watched, I worry a bout Japan & Germany leaking and dumping in to the sea of trump waist and may be if they dump Zirconium rode too . 2T up for your v d o thank .",
    "Humans, forever on a quest to find the best way to boil water to make something spin.",
    "Because its easy to consume, it costs money to recycle.",
    "Very interesting stuff, had no idea. But end of day there's still way too much of the waste left. Imho; as a method to limit import and dependence from e g Russia it's well worth paying the premium though. Independence is priceless,  especially these days. Btw; here in Sweden there's only plans for underground storage of the waste. Like the Finnish more known 'Onkalo' project.",
    "so much money and a american says we dont need to recycle. wtf is wrong with u. invest in it so we can be a type 1 civ instead of 0.6 or something",
    "Surely the future is Hydrogen technology? DW would do well to make a documentary on this",
    "@4:49 It's recyclable like in bullets, warheads and tank armor. To be pulverized into uranium dust.",
    "America doesn't recycle because of the peace treaty with Russia that Jimmy Carter signed into place. Before he did that, uranium was recycled. The first nuclear plant that was built in America recycled everything. That was their design, but Jimmy Carter screwed that up.",
    "There are a lot of things that can be done with the leftover stuff. Why don't we use it? Massive ignorance, fear, distrust. Mostly fueled by the media and government.",
    "AFAIK the reason we don't re-enrich spent nuclear fuel is because it would make weapons grade material more common.",
    "Thank you for this video! My high school engineering teacher mentioned that he worked to patent nuear fuel recycling many years ago but the US wouldn't opt for it. I wanted to learn more but never found anything about it and started to wonder if he was bluffing.",
    "We are building a circular economy that is environmentally beneficial for humanity and earth, and we have the scientific technology, and the modern scientific inventions to address nuclear pollution, nuclear waste and to reuse and recycle waste efficiently.\n\nEcologists and chemists/physicists are long overdue in taking action on this matter.",
    "Normal nuclear reactor dose NOT generate military plutinium. It's produce PL 239, PL 240 and PL 241 in equal proportion, and it cant be separated like uranium 235 and 238.",
    "Why dont you Take a train instead of driving?",
    "I'm sorry but she sounds like she's against recycling!\r\nWhat else should we do with nuclear waste?\r\nThrow it into the sea like in the 60s or just dig a hole like we saw at the beginning, throw it in and forget about it?\r\nStatistically speaking, this buried waste is already starting to rust (the barrels!). In other words... it leaks out and pollutes the ground and eventually gets into the groundwater!\r\nI don't have a high school diploma and I'm smarter than most people who think the same as this lady!",
    "Is not it uranium from the ground more dangerous than depleted/used uranium?",
    "@DWPlanetA >>> Great video...",
    "Steel protects against radioactive waste. What?",
    "Costs too much thats why.",
    "I imagine theres some old white haird bastards sitting laughing about \" pesent waste\" ...",
    "Just eat it",
    "The same reqson we dont recycle a lot of things, cuz it costs more, resource, time, energry wise to recycle than to use brand new.....",
    "Because.. RADIOACTIVE!!! mygaaad ",
    "India is now using Plutonium with Thorium in Fast Breeder Reactor and getting U233 another fissile material to reuse again with Thorium again they get U233 as spent fuel because non fissile Thorium absorbs neutrons from Pu in the first process and from U233 in the second process and change in into U233 and the cycle continues",
    "Our necular plants can not use waste because of Carter. We  can make necular plants to recycled for plants. President Carter was an idiot.",
    "Easy answer would cost more money.",
    "It never stops being funny to me, that we've gotten to the point of such advanced concepts and processes, only to still use them to boil water and turn a turbine to produce energy.",
    "I understand that recycling is hard and expensive but i think it's crazy to give up on it",
    "NIMBY everyone is scared because of the lies",
    "We recycle 1,  bring in 50 plus... Math doesn't add up. Think it's great to clean up. How much is burried. What about all dumped in ocean seas?",
    "Long story short, it’s not profitable. If it was, we’d be doing it.",
    "Because Greens.",
    "Because of stupid fear mongering.",
    "You said it right: France has the highest share of nuclear power. It is no surprise that the operator, EDF, went bankrupt, because it chose for it's energy production the most expensive technology: nuclear.\nWhat defines human's insanity more than creating the most toxic human waste while warming up water!",
    "woke detected",
    "$$$",
    "TLDR: Your own shitty politics. Thanks for listening to my TEDtalk.\nAlso talk to your local representatives abt LIFTR reactors, so we can savely use radioactive material without any way it can be used to enrich or make weaponized plutonium, unlike in current reactors based on uranium, which can be used to enrich plutonium directly or plutonium will be a \"byproduct\" from recycling uranium fluerods...\n\nFn make energy instead of trying to find a backdoor to make weapons with it.",
    "u Know what else is masive LOOOOW TAPER FADEEEE",
    "Used fuel IS recycled",
    "Wow. Thank you for the insight. Nuclear power is the relatively commenly debated topic where I always felt the least knowledgable in, so I am glad for the insights.",
    "You have very little. Knowledge.   Misss.  ",
    "HEMP >>>>",
    "Permanent storage?! I still feel like that can't be 100 percent permanent. Its gotta leak or break down at some point. Or someone will start a new project and uncover all this waste. Ive never been so close to radioactive waste!! Are you complaining? I wish the USA would do something like this.",
    "*Reality: The construction times of all nuclear power plants in the last 25 years have ALWAYS been at least twice as long as planned. And the construction costs have ALWAYS exploded by several hundred percent.* Just google: “nuclear power plant, costs” - and then the name of the nuclear power plant Flamanville/F, Hinkley Point/UK, Olkiluoto/FIN, Oma/Japan, Vogtle and Virgil Summers/USA. In January, for example, the French Court of Auditors published the real costs of the Flamanville nuclear power plant, which went into operation in 2024. It was €23.7 billion instead of the planned €3.3 billion!!!",
    "Business idea, using the spent nuclear rods for centralize building heating using heat exchange through liquid coolant during the winter.",
    "Because of the oil subsidies: we allowed fossil fuels to drop toxic emissions straight into the atmosphere, and using our common air as a free dumpster. Implement carbon tax and pollution penalties, and remove any subsidies - this will set the fair competition for the energy- and you should see how nuclear and renewables will start growing.",
    "RIASSUNTO PERFETTO-MILIARDI DI SOLDI-RAPPORTO RISCHIO BENEFICIO NEGATIVO COMPLETO-QUINDI MEGLIO SPEGNERE E METTERE IN SICUREZZA CIRCA ",
    "The term nuclear waste is too broad, fuel rods is what your talking about!",
    "Nuclear is stupid, Fusion is hope.... why people is so stupid to don't understand that.....",
    "Visit a Starbucks ... reused in frappe's .. tastes that way. LOL",
    "If we spent the same amount on nuclear as we do on fossil fuels what could we do? In the 100 years of using fossil fuels we have learned a lot. \n\nSome think that electric or battery will be next. The problem with every solution is the risk to cost. If we understood why water could evaporate in freezing temperatures and with no sun then we might be able to find clean energy. There is no money to be made in finding clean energy so small labs are all that are trying to do it. \n\nIf we moved into a world where money didn't exist what would we do and how would we be doing it? Money is just something that we made up and we let it stop us from doing great things. \n\nIf it cost to much money. What we are really saying is that it is not worth the time and effort to do. \n\nRemember that everything is ran on fossil fuels. How do we mine? With ether gas, or diesel. If we want to think that it's clean we turn it to electrical. How do we get electricity? From the most part fossil fuels. \n\nWhy are the oil producers looking for something else to fund them? Could it be that they are running out? It's not our problem and it will be in the next 200 years. \n\nThe other question is why do we use the nuclear fuel until it's spent? Is there a cleaner way? Like maybe looking at nature. Does nature use things until they are spent? Not usually. The Earth has a lot to teach us and we don't listen because it costs to much? To much what? Life, because money is made up. People choose how much money is worth. So money is not a very good answer.",
    "If the dual fuel reactor works out to fulfill its promises, none of this is necessary. And all of this is a gigantic waste of time and money. If....",
    "\"It's too expensive to recycle\" is such a boomer response to a problem like this. Just kick the can down the road and let the next generation deal with thier lead brains.",
    "Cost!",
    "Maybe because the rich people have money from the current system so they get \"dumb n lazy\"",
    "Germans now burning coal is such a twist ",
    "Not all the nuclear trash is fuel. Its radiation affected trash.",
    "I am really happy to see this documentary. It is amazing and full of consise details. It would be better if you can explain fussion product. I want to know more.",
    "Great video! But i would say that you missed out to tell about for example Seaborg which is a Danish company that uses the molten salt and they have come very far with it as i understand it. They should have the first reactors or what you should call them ready by 2026",
    "If we can't fuguire out how to recycle solar pannels, how are we gonna do it with nuclear?",
    "what about usage in Molten Salt Reactors or generally Fast Neutron Reactors?",
    "Half-Life 1 in real life. Where is Gordon Freeman?",
    "Notice you didn't mention that the plutionium recovered from recycling cannot be used without 235-U, thus rendering extaction  economically  impossible. IMOX COULD use 30% of the transmuted fuel, NO ONE can use the daughter products or the superheavy tranmutes like 241U. ALL the 239-Pu is weapons grade, no other way to use it.",
    "Reporter looks so nice ",
    "America reused theirs, mostly in iraq.",
    "There was a movement to dump spent radioactive rods into the food packaging recycle stream",
    "Didnt even watch 1 sec of the video. The answer is, are you ready? There is no money in it.",
    "I think they said it was a diamond nuclear battery music very small amount of it",
    "You can make a battery out of them",
    "Because of the money wheel.",
    "My hope is that one day, we'll be able to directly extract the energy in some way without using these fuels as a catalyst to operate something else.",
    "Impressive work! I didn´t know any of those facts :)",
    "The business people do not find it profitable enough. They can profit more from dumping nuclear waste in the 3rd world countries and rarely populated areas.",
    "money",
    "why can't they use the waste for and build THORIUM reactors as thorium reactors eat spent uranium fuel???????",
    "All the stores of nuclear waste will almost certainly outlive the nations that create these systems, so at some point in the future they will pose a danger to biological life on Earth. Imagine, waste that can remain dangerous for thousands of years that is being stored by nations that have only existed for a few hundred years, and where mankind has a colorful history of birth and death of nations, conquests, and destructive wars. Seems like these stores are a long term liability.",
    "IF WE DID, THEN WE COULD GO BACK TO USING THIS POWER",
    "There are also red blue green and black pen in studies . BLUE is different  red is alright .They want to make us slave",
    "The best video I've seen on nuclear waste!",
    "Planned obsollation.  \nInsane race for money and power .    Capitalism is the biggest threat for humanity ",
    "Saying there more uranium and theres no need to spend the money to recycle. But it’s ok to spend the money and fuck yo the environment to keep mining the shit right? Or it’s ok to just used it and throw it away and have all this fuel taking up unnecessary space right? Why are we so wasteful as a species",
    "1 kilo of uranium is equivalent to 300.000kg  of coal do the math",
    "Yes, the problem is political, because it's the USA's historical hegemony in oil based economy, that is directly responsible for strangling the nuclear power generation sector.\n\nYou can extract MUCH more value out of the oil sector than the nuclear sector, simply because oil is so much less efficient and hence needs many more stages of production - each of which adds $$$ to the corporate bank account.\n\nIt's the oil barons of the US, married with the US financial sector that lobbied for economic destruction of the nuclear power generation.",
    "Elon musk could blast them into space lol",
    "it insane that nations has pulled back on developing nuclear power just because of things like chernobyl. it's like a caveman not lighting anymore fires because some idiot burned down his hut.",
    "So pretty much it boils down to the equivalent of changing the batteries in your remote with new ones every time you change the channel.",
    "Nuc-U-lar. It's pronounced, nuc-U-lar.",
    "Plutonium is no riskier than another radioactive thing.",
    "Just because we are not using nuclear waste doesn't make it waste - but every little or big thing that comes in contact with nuclear contamination becomes waste -  just because you washed your hands, and they are now not contaminated does not mean you have solved the problem - what is with the water you contaminated?",
    "Because the entire recycling industry is a scam….",
    "30-Year decommissioning period of any old atomic power plant prohibits its cost effectiveness and the the at least 50-year storage, the fact that for a billionth of the cost you can have solar power for the next 60 years. \n\nThere is simply no way around the fact that solar is the cheapest energy out there, and is continually getting cheaper as well as the batteries getting cheaper, storing more, charging faster and there's no end in sight of these innovations. \n\nAtomic power has never actually been profitable, it has always been highly subsidized, highly toxic, highly dangerous, and a fool's errand with anybody who can Read a spreadsheet",
    "Usa help pakistan to make nuclear weapon  and india make it own nuclear weapon",
    "A couple of years ago DW was advertising nuclear phase-out. What happened now? Ohh, Germany's industrial output at risk because of high energy costs so, Germans started to be nuclear fan-girl again.",
    "can we use the recycle nuclear as weapon...",
    "A far safer tech is on the way. THORIUM and Liquid Fluoride reactors are coming to reuse the \"spent\" fuel & a whole lot more...",
    "Your all doomed have a nicer day.",
    "France cracked the price problem already though: scale. \n\nThey built their grid on nuclear fuel (which is already efficient) and so they had a massive amount of spent rods to deal with. The left over fissible material was still in there. They needed a way to reclaim it. So they did. If the US went through uranium at scale like France that process would likely be more appealing\n\nThe NRC woman from BC just said out loud the way the developed world (including France in most other situations) treats all materials. If it’s cheaper to dig it up and throw it away that’s we’ll do. Even if we run out and will have no idea what to do later. Even if we have nowhere to store the waste. \n\nRecycling is rarely economic. Left to the market no one will do it. Doesn’t mean we shouldn’t do it though.",
    "If it's so lucrative, how comes no energy company is going after it? On the whole world nobody does it.\nAnyways the biggest security risk for me is the IT. We have so many compliance tasks and regulations expecting from you to install anti virus, VPN and other stuff. However these exact companies are opened left and right with decade old security holes. Every week a vendor is caught with their pants down (unauthenticated remote code execution, auth bypass, no auth at all, hardcoded credentials, open s3 storages, unsanitized user input right into a root shell, etc). EVERY WEEK. All major vendors are affected. Running security software is a security risk. Besides Windows, Office and AD. And that's why I don't want any nuclear reactors. I don't want to read \"nuclear reactor blew up because the VPN gateway was not updated in 10 years. Nobody felt responsible\".",
    "Ah yes, the lie/myth about the \"closed nuclear fuel loop\". They tried to sell us that even back in the 70s in primary school already. Somehow neglecting to note that it INCREASES the volume of radioactive trash that you have to store BY A FACTOR OF SEVENTEEN.",
    "This was most interesting to me because here in Australia, the upcoming election will have nuclear power on the agenda. But first we have to get rid of the nuclear moratorium.",
    "Ist deine Erde eine Scheibe???",
    "Ineresting\nThat is why French were unmoved when they got kicked out of Niger. They can run their power stations on other countries waste. Well done!!! Something for Britain to aspire to",
    "Big oil",
    "Climate cult is your answer",
    "As a Mechanical Fitter, I find this very informative.",
    "14:22 It shouldn't be \"because\" but should be \"thanks to USA (!) this is still in the experimental phase\". I wish they didn't lead the world..",
    "Weil wir dumm sind",
    "The worlds governments are just lazy and love to spend money",
    "I disagree with nuclear it's far too dangerous and toxic, No Way,  I'm not interested in the advantages as good as they are!",
    "11:36 no need to recycle nuclear waste? More like no profit incentive :p",
    "Why are you wearing a hairnet in the video? the employees are not wearing them...",
    "Do the fission products have the same halflife as the uranium/plutinium?",
    "Is recycling the nuclear waste into MOX fuel profitable at current uranium prices or does the state lose money from recycling?",
    "France could recycle more but thanks to the Greens the reactors Phenix and Superphenix have been closed. There's still the Astrid project but EDF and the politics don't have the money to take the bet to build it.",
    "hmmm, what if with elon musk's starship you could send 150 tons of nuclear waste into space per launch? that would probably be not more expensive than the current process, but obviously that would never happen because of the risk of failure",
    "So we don't kno the real cost of nuclear power...",
    "Short an easy answer: Hypocritical leftists",
    "I was told it’s cheaper to buy new fuel than to recycle.",
    "Most likely due to monetary reasons. \n\nSince that's what it's always about.",
    "people scared of nuclear power cause of chernobyl but that is the number 1 clean energy in the world. and people saying they want clean energy but they build alternative energy plants like solar or wind. kinda stupid",
    "We do.",
    "Like any recycling not economic. Except glass and aluminium.",
    "Bcoz it is radioactive even it is usable",
    "I feel like space travel will become so safe and effective that we will start sending it into space",
    "Just an uneducated individual here, In my opinion future energy demands will be met by upstream efficiencies in transitions of energy, Meaning French was smart to  Initiate recycling despite costs, the downstream disposal of nuclear waste in molten salt reactors are another form of power generation, Then combine 2 dimensional engineering that  Utilize quantum Properties of materials on tungsten plates to turn thermal  Energy directly into electricity can be used for extraction of power in the cool down of the materials, The future is in upstream efficiencies not down stream compensation.",
    "The reason why we don't do this is because it is cheaper to make new fuel. Once used, we don't \"throw it away.\" it is stored for it to cool down naturally. There will be a day when our hands are forced to recycle the stuff. But not now. In fact, we might discover a new, truly clean energy source before we ever have the need to recycle nuclear waste. In the meantime, it is being stored safely and responsibly.\n\nNuclear fision is around the corner anyway.",
    "lol this comment section is the perfect example of why engineers can’t be trusted to make decisions… for all your knowledge and education and experience you still can’t even grasp how and why nuclear is a very dangerous technology… and the main reason for that I think is 1) engineers have a very restricted and hyperfocused education, and 2) our society does not yet value the health of our planet.\n\nThis is not an engineering problem. It’s a risk management problem, and with technology as powerful and impactful as nuclear even a 0.00001% risk is simply NOT worth it.  It doesn’t matter how good your design is, things can always go wrong and the consequences can be disastrous.  You’re all so focused on your known knowns and your known unknowns that you completely forget about your unknown unknowns, and that’s what always gets us in trouble: the scenarios we did not imagine could happen.  The health of our ecosystems is something engineers know almost nothing about, and is far too important to leave to chance and human error.\n\nBesides, we already have a reactor millions of times more powerful than any we could ever build.  Engineers should be focused on solving space based solar power rather than nuclear power.",
    "Nuclear power and reprocessing was always a cover for bombs. From the start all they wanted, expense no problem, was the Pu. So right from the start they lied about the real costs, full cycle costs of nuclear power. They are huge. The cost of cleaning up the UK plants continues to mutiply as new problems are uncovered. All that could have been used for renewables.   Nuclear electricty officially costs twice as much as wind. The real price is much more. France would be better to build enormous wind farms and solar farms and batteries etc. They lag behind other european countries because they want an independent nuclear 'deterrent'.  Nukes are a sinkhole of government lying and waste of tax payer money.",
    "Because you can’t!!!!!",
    "Reminder that this person is not suicidal in any matter",
    "Nuclear energy goes against the climate change narrative that they use to laundry money, and push laws that have nothing to do with climate change, the media gets paid to to demonize nucular energy where they keep intentionally using outdated information from previous disasters as reference to why nuclear is bad, while leaving out information about miraculous breakthrough methods and solutions that have been already achieved decades ago, also hydrogen is also an alternative energy source that's more cleaner to process, than compared to the efforts whenharvesting oil",
    "So nuclear not only uses less waste than current fossil fuels but could potentially be using 5x less?",
    "Nuclear waste are not reused because of the risky nature of the waste.",
    "could store it until it beome econnomical to reycle",
    "Germany green party all idiot",
    "The answer is simple. We don't have the technology to recycle nuclear waste yet.",
    "Yo all not talking about millions of tonns of contaminated soil and contaminated water",
    "Closed cycle fast neutrons reactors. These can recycle up to 99% of the uranium (fuel) and produce very little radioactive waste. This technology is already operational in Russia and is something other countries can use in near future, but anything Russian is not kosher for DW",
    "Very western most tip of France, so that would be as close as possible to UK? Thank you EU.",
    "Ty",
    "But almost at the start, the caskets, he says the internal temperature is 200-300°C, can't that be used as a heat source to then convert into other types of energy? If i'm not mistaken, that decay and heat production is selfsustaining for a long time, and since we don't have another method of using the energy directly instead of converting it for the time being, isn't that a better solution?",
    "It would have been nice to cut out the childish exclamations along the way, like the one @ 4:25",
    "Lots more plutonium if everyone recycled? No, thanks! Storage of materials that remain dangerous for longer than human civilization has existed? No, thanks!",
    "Fast breeder reactors aren't economically feasible and producing and delivering nuclear power is a profit making project.",
    "This honestly makes a really good case for storing nuclear waste in facilities rather than burying it. In the future when uranium starts running out, we won’t need to bury our waste, France might just buy it off of us or we may even be able to recycle it",
    "All they are doing is GUARANTEED  for a future lifeless polluted planet earth .",
    "Refuse, reduce, reuse, repurpose, recycle.",
    "If recycling an aluminum can saves 90% of the energy vs making a new one then why don't or do it? \nBecause people are stupid.",
    "Well, it's nice to know that we won't run out of uranium any time soon if the raw source material becomes depleted in the future. 96% recycleable is insane, that's power for thousands of generations.",
    "Shipping purified uranium across the country with the French Army. Ah yes the French Army, the same one that has gotten overtaken by mafia & gangsters many many times in the past on these “protection” missions?",
    "Amazing video, Thank you",
    "Indonesia gov. will develop Nuclear plant at Bangka Belitung island. It's quite ambitious idea even for me as Indonesian people, cause we're same like Japan Geographic but different in a way of thinking. There are lot of unstable situation such as volcano, earthquake, etc in here. Unlike France and other Europe country.\nWithout learn from Japan, China, France  and knowing the itself situation, I don't think Indonesian goverment will ready to face the worst and unexpected situation in front of them.\nTbh, I just criticize how they prepare and think for environment, society, and energy ",
    "Undisputed leader in full cycle nuclear power supplies is Russia, not France. But I understand you guys are not allowed to say it here ",
    "Been saying this for years. Nuclear waste is valuable stuff. Tricky to process but full of useful elements. The only hard part is dealing with it safely for long exposures to materials and high temperatures. Not necessarily human exposure. Humans need not be involved but for the ones at the controls.",
    "The  problem is the cost associated with recycling uranium rods. Now with newer reactors smaller reactors is that we can use the old rods and get them used down into about 8% of the half life.\n\nPretty sure they are playing around with super heating the waste to pull off more product and burn off radiation but I can't remember.",
    "shelf life",
    "HAHAHA GERMAN STATE TV PROMOTES NUCLEAR, ALMOST THERE BOYS.",
    "Hellooooo thooorium wtf",
    "Even if my country doesn't process nuclear fuil that doesn't necesserily means all the other countries wouldn't.",
    "It's really a shame seeing the global negligence surrounding nuclear fuel. it's unrealistic to fully convert to green energy but we need to find an alternative to fossil fuels. Nuclear energy is clearly the answer and I hope there is more effort put into making this renewable going forward.",
    "So this is a SLOW version of Teller/Ulamb adding an additional tamper that isn't a primary fuel but like U238/Pu239/Li7 when struck by neutrons they become activated and contribute to the reaction?  MOX fuel and boosted fission bombs are so similar then its really just the rods and moderators keeping it from becoming a bomb.  Lets not be facile here.  This technology allows for Pu collection and production!  Pu is FAR easier to make into a working 1st gen nuke, aka an atomic weapon as opposed to thermonuclear ones. (H bombs)  WIth Pu a weapon can be WAY lighter, smaller, and thus easier to transport and deploy.  Ramping up ACCESS to Pu anywhere with several hot wars involving rapacious Amoral regimes is a BAD fucking idea.  (YES, that F-bomb needs to be there to not the seriousness and insanity of promoting this, for now at least)",
    "I knew this before clicking, tbh.  As a freelance backyard engineer,I learned ... nah I didn't know anything until the end.  TY.",
    "I am shocked. Where does the USA stand in recycling efforts?",
    "Simple answer: greed. The coal and oil industries lobbied politicians and spread propaganda about nuclear power being toxic and dangerous. They threw so much money at their problem that no one could resist.",
    "30 seconds in, who wants to bet the answer is cost? Minimal effect from other factors like logistics and environment..",
    "Well in the movie Godzilla 1998, Godzilla was an iguana from France. Makes sense.",
    "So what the hell are \"fission products\" and why are they unusable? Why is only 30% less uranium used if 95% of the energy remains? Why can't the plutonium be used by itself? And why is the MOX not reused?",
    "We are creating to much nuclear waste due to short cycle use of fuel rods .. Because nuclear weapons have a short shelf life ..",
    "Very nice video",
    "Radiation is very dangerous and last for ever, don’t talk about it like you are\nRecycling glass bottles, the waste from recycling nuclear waste has contaminated the Irish Sea and the beaches on the UK side are empty as nobody wants to be exposed to that radiation or breath in plutonium particles",
    "canadian candu reactors",
    "Simple answer: POLITICS",
    "What about thorium?",
    "There is some BS in this because Uranium can/ is also used in Bombs as well, So the \" we can't reprocess because it will make bombs \" is rubbish!!",
    "SOLAR IS LITTERALLY 3-4X CHEAPER THEN NEW NUCLEAR.... ILL BET ANYONE $1000 YALL IDIOTS IF THINK NUCLEAR IS FUTURE.... ROBOTS CAN RECYCLE SOLAR IN FUTURE EASILY...",
    "Awesome  educational  information  for our NONE INDOCTRINATED Next generation of young adult who choose too open there minds to learn to become  LEADERS into 2050 2100  ENERGY MANAGEMENT TECHNOLOGY   & ADVANCED FUELS \n\nPLEASE  LESS INFORMATION  about the plutonium transportation or locations \nSleeper terrorists  cells in future 2030--2075 yrs  could  effectively  learn these information  too intercept  the shipment  or stage a violent hostage concern of a facility.....\nThere is evil  & THERE IS EVIL INDOCTRIN",
    "What do you mean we? I'm just a plumber",
    "Killing mother earth",
    "Release the unsimplified version of the recycling process please!!!",
    "Nuclear waste should be dumped in a deep ocean trench.",
    "Liers! Pu is 240! Not a 239. And it not be bomb-production",
    "poorly researched\nThe indians ran their  CANDU reactor in a way to produce high purity Pu239, you cant run a CANDU reactor commercially and also produce high purity Pu239 at the same time. so reprocessing fuels from commercial reactors doesnt have this problem, because commercial spent fuel has alot of Pu240 and Pu 242 which are detrimental to nuclear bombs, so You CANNOT used spent nuclear fuel from commercial plants to build bombs.  as I said, poorly researched documentary which only presents false information about nuclear fuel reprocessing, painting it as a risky affair prone to proliferation, which is not true.",
    "Good. Army need depleted uranium rounds and Plutonium for nuclear warhead.",
    "Good video. Subbed",
    "its reusable, ask Bagdad kids !",
    "Money is the worst thing we ever made.",
    "Mere fact that slavs can't boil water mustn't mean the world should give up on nuclear energy.",
    "Ставь лайк если любишь маму",
    "s o its India's Fault?",
    "Sponsored by the nuclear energy industry",
    "haha so pathetic, the idea the entire world can start producing nuclear waste on scale like that is atrocious. How feeble a simple planetary apes mind is...this is NOT the Worlds energy solution. Keep looking.",
    "Sounds like France is planning for a long-term solution in the centuries to come.",
    "As an expert Satisfactory player, it very easy. once you have the support infrastructure built. You just need to have your conveyor belts of nuclear waste take the barrels out of the power plants and convert them into non-fissile Uranium thru a blender. Take that material and run it thru a particle accelerator into Plutonium pellets. Take those pellets and put them in an assembler to make encased Plutonium cells, and finally a manufacturer building to make plutonium fuel rods which can be used as fuel and create worse waste or completely destroyed in an Awesome sink machine. ",
    "People never believe me when I try to say how good nuclear energy is. Everyone's reasoning for being against NPP's is cook offs and nuclear waste.\nI keep telling people that there have only been 4 cook offs, only 2 were super destructive (Chernobyl and Fukushima.) I also say that the waste is still reusable but everyone calls bull.",
    "Stupid fake news",
    "Spent fuel is not reprocessed for one reason. It is cheaper for reactors to use U-235 from mining. \nNow let's talk about reprocessing. It is by far the dirtiest, most dangerous process for nuclear workers. It is also the most polluting process.  It is very expensive and only reclaims 1-2% of the spent fuel for reuse as plutonium and U-235. The rest is still nuclear waste. Once the reprocessed fuel is reused once, it is again... wait for it, nuclear waste. La Hague and Sellafield were the only reprocessing plants in Europe. They have managed to make the Atlantic Ocean all the way to the Arctic Circle the most radioactively contaminated ocean in the world. Sellafield was shut down. The British government estimates that it will cost $1 billion a year just to maintain the site and at least 100 years to clean it up at God only knows what cost. La Hague no longer has any international customers and only reprocesses for its parent company, Orano, which has been taken over by the French government to keep it from going bankrupt. Pity the poor French taxpayer.\nRussia has 2 reprocessor on barges that cost exorbitant sums and very lengthy times to start up. Their performance has been very disappointing and they run at less than 30% efficiency. The only advantage is that they are on barges, so the spent waste can be dumped directly into the Arctic Ocean, instead of having to be transported to the sea like the rest of their waste.",
    "The main reason for not recycling is \"follow the money!\" Fresh uranium just costs less to process into fuel elements.",
    "If Germany really could get back to nuclear energy, which would be amazing, we could easily afford the recycling plant since all the subsidiary we pour mindlessly into \"green energy\" projects like windfarms and photovoltaic to make the electricity somewhat affordable for the citizen (which it not really is since it's the second most expensive electricity in the world), is around 6,5 Milliards a year. Statemoney, tax money every citizen works for. That's how contradictory left and green politics are. \"Work and earn 2900€ in taxes every year so that you can save 500€ a year in electricity costs\". That's the amount of tax every employed or taxpaying citizen must earn in taxmoney a year in Germany for the subsidiaries to uphold the green and cheap energy lie. While paying CO2 tax on top of everything like the VAT. It's ridiculous, all that money and they say they don't have enough...",
    "The rest of the world does not recycle because they dont factor in the negative externalities of Nuclear energy. They simply buy more uranium. At least France is taking some charge. What is interesting is to see how little uranium is needed to power a whole country, compared to oil its just a peanut, almost zero carbon and zero deaths per megawat. But dont tell it to greenpeace.",
    "Hydrogen is cheaper cleaner and more reliable. Why dont we just use hydrogen ms smarty pants",
    "Well France also wants to get Plutonium for their weapons.",
    "Germany had a receycling-plant in the 80s, but Green-woke lies and fear destroyed it.",
    "Rip channel",
    "9:58 That's what she said",
    "Oh so, once again the USA government gatekeep the technology because they want to control everything to their behalf.",
    "Doesn't make sense to recycle. Omg. The mindset. It's cheaper and easier to mine the shit out of everything then blow up mountains and throw nuclear waste inside caves or the ocean. There is no respect for the natural world",
    "12:22 MASSIVE?? AGAIN??! LOOOOOOOOOOOOOOOOOWWWWW",
    "Saying that \"96% of nuclear waste is reusable\" is such a vague phrase.\nA lot of nuclear waste doesn't even come from nuclear power reactors.\nAnd even if we exclusively look at nuclear power reactors, then over 99% of nuclear waste is not spent fuel rods, but stuff like clothing, tools, rags, etc, that picked up small amounts of radiation during maintenance.\nAnd yes, the vast majority of those scary looking barrels contain trash like that; lab coats, those plastic wraps for your shoes, etc.\n\nWe expect better from you, DW!",
    "In order to reuse it we have to do something that looks like we are making nukes.",
    "Of all the countries, the US not doing reprocessing is the most shocking.  \nThe US is MASSIVE and has tons of nuclear power plants.  \nI can't fathom why there isn't at least ONE main recycling center in the *entire* country.",
    "Sigh.. Could probably have global warming and air pollution behind us if we invested in converting to nuclear instead of letting people blame someone else for their pollution as a genuine strategy (carbon offsets)",
    "I don't want to be annoying, but if the fission products account for 4% of the total \"waste\", and you would only need 5x more room to store it (10:35), wouldn't that mean that one of those numbers is wrong. I myself am a fan of nuclear energy, so i came up with a couple of interesting reasons.\n\n1. The question was asked on the spot -> the man might have misinterpreted the question\n2. The fission products are encased in glass, this takes up more space\n3. It might be easier to store more \"normal\" nuclear waste as it could maybe be stacked more then 9 times on eachother\n\nI'm quite curious to the answer. Please answer if anyone knows!",
    "yes lets reuse it for APFSDS",
    "We are just manufacturing bombs waiting to explode one day",
    "Because we are totally and utterly brainwashed about nuclear energy",
    "great video!!!!",
    "Why no USA???!? One of the most rich countries on the world?",
    "Talking more for the US. I still don’t understand why more fuel isn’t recycled. If the plutonium is safely guarded it isn’t a problem but also there’d be less mined uranium that is circulating. Costs should also go down over time as better techniques are discovered, it also acts as a strategic reserve, and you become less dependent on uranium imports in the event they get disrupted.",
    "My country. Aka America. Will use depleted uranium for ammunition for non nuclear weapons",
    "Ah the tried and truth slogan of the future. We have every solution to every problem but we just don't want to do it.",
    "We don't care because it cost too much money is a hell of a take.",
    "Why do they separate the plutonium and the Uranium, ship it across the country, and then mix it together again? Why not either leave it mixed, or remix it in the proper ratios at the facility? Certainly with all the equipment they have there, it wouldn't be that much harder to add on a couple rooms to mix it back together",
    "So crazy that even nuclear energy still is basically just a new way to heat up water to make steam",
    "The reason has nothing to do with human nature or conspiracies but all to do with cost benefits including those associated with safety and environmental protection.  The current methods for reprocessing spent fuel for reuse, are more expensive than safely storing it and replacing it with fresh new fuel. The process itself is energy intensive, requires the use of toxic chemicals and results in a large amounts of conventional and radioactive waste.  In addition,  it poses conventional and radiation hazards to people and the environment.  So, unless we are looking to build nuclear bombs, we are better off as a society to put the spent fuel away in safe underground repositories where this valuable resource will be available to future generations once technology catches up.",
    "Simple, when humans hear radiation they start shitting",
    "You probably haven't heard that a closed-loop reactor has been operating in Russia for a year now",
    "Why aren't we doing it? Well in Switzerland it was decided by referendum, that we are not allowed to export nuclear waste. So, we are sitting on a pile of spicy chunk, that could be recycled in eg. France, but can't be sent there because some part of the population though themselves to be oh so noble for not imposing our nuclear waste on other countries. ",
    "Nuclear power has waste that is buried in deep mines, so that is not recycling. It could be sent to the sun in a rocket.",
    "I've watched the Orano video twice, but never quite understood the process. Thank you DW for this explainer.",
    "American government gave away its nuclear \"waste\" as waste to private companies to sell, so theres no benefit to the taxpayers.",
    "imagine if early humans stopped using fire because some idiot burned their house down lol",
    "Yet another reason why germany is utterly stupid for roling out nuclear",
    "Basically the US is the one guy who brings his bat to play and when others bring their bat he dsnt like it",
    "Mainly because they cannot tax if for its whole usable life.",
    "I’ve been wondering why we don’t recycle nuclear waste for years. I’m just a biochemist, so this is not at all my expertise, but the fact that the waste is so radioactive but we can’t use it seemed weird to me. There are also other radioactive materials that could be used instead, but I’ve heard that the plutonium is a desirable byproduct due to its use in bombs.",
    "Terrapower reactors consume waste",
    "Oh ho-ho!",
    "why did you simplify the way they recycle it if I'm nerdy enough to click on this I want all the details",
    "Wired did a huge article about this many years ago.  The US plants built in the 60s can’t use it all.  The French built breeder reactors that could reprocess that waste and we’re begging the US to sell to them.",
    "make them into battery  i install extit sign that would last for ever",
    "Why ,its easy....its cheaper...Its always about the money.",
    "Wouldn't it be a great idea to take all the money out of the green scam, and instead use it to build a fast neutron NPP of some sort to fission all of the U-238 and the actinides? We'd have enough energy for thousands of years. When we also use thorium as fuel in these types of reactors, we'd have enough for at least tens of thousands of years of reliable energy. The waste, consisting only of fission products, would have a half life of about 30 years.",
    "Kalkar anybody?",
    "Put it somewhere and we will use it when it’s economically feasible. Heck it’s not going anywhere, there’s no rush to use it.",
    "This is journalism yo what happened",
    "Let's not delude ourselves about russia and china their intentions about plutonium production, I mean fuel recycling.",
    "Seems like considering something other than U-235-based LWRs would be a better approach.",
    "Nuclear waste can be used unmodified as a cure for liberalism.",
    "Because Germany outlawed nuclear energy in the first place-?",
    "Burn COAL Scub Stacks. Fk this acid dirty bull.  Shit",
    "It’s obvious. Climate hoax !!! Duh !!! \nIt’s not about cheap energy \nIt’s about control and oppression of the plebs by the elites ! \nTotal global domination not sensible practical solutions !\nMAGA now !!! ",
    "LOL!  German MSM which was once spreading the anti-nuclear message just a few years ago to promote coal (no joke,  YOu did that DW!) is now flip-flopping because ...  you lack morals and intelligence and honesty.",
    "Nuclear Waste is Recyclable: Up to 96% of spent nuclear fuel is recyclable, containing over 90% of its original energy.\r\nFrance Leads in Recycling: France has the highest share of nuclear power globally and operates the largest nuclear recycling plant, run by Orano.\r\nOrano's Recycling Process:\r\nSpent fuel rods arrive in heavily shielded 110-ton casks.\r\nRods are stored in pools for 5-7 years to cool down.\r\nA chemical process separates uranium, plutonium, and fission products.\r\nUranium can be reused in reactors.\r\nPlutonium is mixed with uranium to create MOX fuel, used in reactors, generating 10% of France's electricity.\r\nFission products (4% of waste) are vitrified (trapped in glass) and stored, awaiting a permanent storage site.\r\nChallenges of Recycling:\r\nCost: Recycling is more expensive than using new uranium, which is currently abundant.\r\nPlutonium Proliferation: The process produces purified plutonium, a key component in nuclear weapons, raising proliferation concerns. This is a major reason why the US stopped reprocessing in the 1970s.\r\nTechnical Complexity: The recycling process is complex and not widely available.\r\nWaste Generation: Recycling generates other waste from chemicals and equipment used.\r\nMOX Fuel: Once-recycled MOX fuel isn't currently recycled again, eventually becoming waste.\r\nGlobal Recycling Efforts:\r\nFrance is the leader.\r\nRussia recycles about a tenth of what France does.\r\nIndia recycles and plans to expand.\r\nChina has a demonstration plant and is building more.\r\nThe UK stopped due to cost.\r\nJapan has faced massive delays and cost increases in building a plant.\r\nFrance's Strategy:\r\nFrance chose to recycle 60+ years ago for energy independence, as nuclear power is crucial to their electricity supply.\r\nRecycling operations and nuclear power plants are state-owned.\r\nFrance is recycling more than it reuses, storing extra uranium for potential future use.\r\nAlternative Recycling Methods:\r\nPyroprocessing is a newer method being researched that uses molten salt, produces less pure plutonium (reducing proliferation risk), but is still in the lab phase.\r\nConclusion:\r\nRecycling is technically feasible and reduces high-level waste volume.\r\nHigh costs and proliferation risks are major deterrents.\r\nRecycling may make sense for countries prioritizing nuclear power and energy independence, but it doesn't eliminate the need for long-term waste storage.\r\nNew, cheaper technologies may emerge, but don't seem imminent.",
    "Oh goodie! Time to learn more information about how/why my country is fucking awful. USA: The Land of Plenty of reasons (greed) to not do the right thing",
    "Why aren't we doing it?\nBecause its a very stupid illusion. Nuc waste is so much more that perfect recycable stuff.",
    "The military likes uranium shells",
    "Because the \"eco energy\" movement has been controlled by gas/petro/coal energy the whole time, they scared people against the real competition and the real solution",
    "Interesting crazy how we haven’t done more business.",
    "We are not reusing them because you germans have not changed since the 40's, you just gone quiet. Germany is against nuclear because it's done by the french that you still hate so much... You need to grow up, stop thinking you are the superior one who is suppost to be the boss of Europe. France is superior for geographical and cultural reasons. The sooner you get it the better.",
    "They \"recycle\" these fuel rods at insane costs then the \"recovered fuel\" does not get used in reactors then sits around for 3 to 6 years its then considered spent again and then its placed into a waste facility? hmm its crazy no one else is doing this.",
    "Crazy to me how we solved the energy crisis like 50 years ago and we only just ended a 20 year long oil war.",
    "This is the downside of solid fission fuel. Liquid fuel systems like Molten Salt Reactors allow for the extraction of fission products while the reactor is in use. Meaning the 96% of usable materials stay in the reactor until it's turned into a fission product. Even the rare plutonium that is created just stays inside. Fertile plutonium (which doesn't like to split) will have decades to capture a neutron and become fissile, after which it will turn into more fission products.",
    "ok",
    "In germany its racist to talk about it. So the technology was sold to asia like always. Now the chinese are using the tech. that germany developed.",
    "10:00 Do you know what else is massive? Low taper fade.",
    "The main problem is money…. That  Musk guy who says he wants to save humanity and other BS, if he really wanted to do so he would invest in nuclear waste recycling…",
    "It’s not really recycling. It’s extending the life of virgin uranium. Which is good.",
    "I like it when dw goes back to it's roots of in depth reporting rather than off balance political social stuff. Good job.",
    "yeah you go and drink it",
    "5-7 years of cooling down in water before it’s processed further???? How long does it take for something to cool down????",
    "The fear of nuclear is insane and just brainwashing from the fossil lobby.",
    "not all nuclear waste is radioactive for 10k years..",
    "Remember to blame your local hippy for robbing us of the nuclear age",
    "that 1g of plutonium = 1 tón of oil Is interesting",
    "I work in a certain place in the uk and I am doing this crap all day",
    "Nice, so as the foreign government you buy MOX from France, for your nuclear reactor as a fuel.\nSeparate Pu from U that is in the MOX and have material for Pu based hydrogen bomb.\nNice move...",
    "It's always about cost..we know the cost of everything but the value of nothing. So many problems in our society are not dealt with just because it does not fit into our profit motive model of economy. \n\nI know it's a complicated problem, but we live on a finite planet and we destroy it at a crazy rate. So many politicians that even acknowledge this issue don't do much about it because they don't want to be responsible for the cost.",
    "The issues of upmost importance:\n\nIt might cost a LIL more if we switched to nuclear.\nThe word nuclear sounds scawy \nWe don’t wike it! \nScawy barrels of barely radioactive safely contained metals \n\nThose are literally the only reasons why we haven’t switched to fossil fuels. It costs to switch to nuclear, but the costs of dealing with the climate crisis is far higher. Yeah, nuclear sounds scary oh no. The only meltdowns were due to poorly designed safety from decades back and bad placement. You know what’s scarier than the word nuclear, the death count of fossil fuels. DAILY, yes I said daily. The daily deaths from fossil fuel emissions alone is approximately 10,000. That’s not even mentioning the deaths caused by the brutal wars involving oil and other fossil fuels. What about nuclear meltdowns? 6,200. Daily? No TOTAL. Around 2,000 deaths are estimated from three mile island combining the few direct worker deaths and the evacuation. The tsunami ITSELF, separate from the disaster wiped out 7x as many people with a death toll of 14,000 which is more than 2x the total deaths from nuclear in just one natural disaster. People aren’t gonna like it, but it’s our only option that’s as efficient as fossil fuels without the toxic emissions. The biggest issue (while still fairly small) is dealing with the radioactive waste. Some companies have been containing them in bad, unsafe spots leading to some small degrees of pollution, but that isn’t the fault of nuclear, it’s companies being stupid. And it isn’t glowing green goop, its fairly radioactive metals surrounded by like 6 other layers of metals and put in a barrel (and that is only a tiny percentage of nuclear waste, as a another commenter said and I looked into it, most nuclear waste is just gloves and other things that are barely radioactive, yet still clunted in mass estimates for a large degree of fear factor). Eating a banana gives you more radiation than being around one of these guys (don’t fact check that). If nuclear was just given a ever so tiny portion of the attention given to fossil fuels, we could probably have enough research to make it practically renewable. But that costs money, so guess we can’t.",
    "Simple, because it is cheaper to not recycle.",
    "no matter whre u look at it, nuclear energy has more cons.. they are sacrificing the future for todays benefits.",
    "Because it's insanely expensive to reuse/dispose of nuclear material",
    "Because people freezing, without light are SO much easier to control",
    "The transuranics are recyclable, theyre just not currently usable with deployed reactors, fast neutron burner reactors can burn those too, rendering them much safer",
    "Loved this. Thank you for publishing it",
    "So its not as recyclable as claimed. Nuclear is not the future.",
    "Commenting for algorithm.",
    "Don’t they make bombs with it",
    "My guess for an answer would be it's expensive to reuse nuclear waste so no one does it because there's not enough profit",
    "The inherent problem with radioactive materials is that they contaminate most everything that touches it. For sources with long half lives that means that any attempt to recycle will ultimately create more radioactive waste than you started with. Even though the activity would be less, it still requires the same handling, storage, and containment for a larger volume of materials so it’s a losing battle.",
    "The statement of plutonium just being used for mox fuel and that india, russia and china are the other nuclear fuel recycling nations left a rather uneasy feeling in me. \nAll nations with nuclear weapons... coincidence? \n\nI don't trust the other nations to not use the plutonium for nuclear weapons and frankly I do not trust the french to just use it for mox fuel.",
    "Germany decided to stay behind and watch other countries grow technologically.",
    "And the French own nuclear power in  countries other than their own and ignore saftey standards",
    "What a superb engineering feat, the French clearly have some very bright scientists and engineers ",
    "\"I feel woozy\", the most scientific term ever used on a nuclear facility.",
    "Guarantee Russia and China aren’t doing it for the environment. They’re doing it for the plutonium so they can make weapons.",
    "Load of utter shit the cost involve is crazy and always will belive how thats not mentioned and what also mentioned is it doesmt work.",
    "We can reuse spent nuclear fuel to make warheads ",
    "So we can’t solve our problems without making up reasons to blow stuff up.",
    "You always talk about how expensive it is to recyclethe nuclear waste, but how big exactly is the price difference between doing it the normal way/recycling ?",
    "Nuclear fuel becomes Too reactive not worn out.",
    "The risks of generating nuclear power just don't out weigh the benefits. I don't understand why we always discuss it like it's clean and safe.",
    "So this let's us use the Uranium that does have an expiration date on profitable extraction for longer. But the current process produces a way to pure Plutonium (making this version very tempting for states that desire to expand or even create their own nuclear arsenal) and tons of extra waste that will have to be dealt with as well. While also costing a ton. Furthermore, the French government is spending millions each year to keep their nuclear energy cheap. Because many neighbouring countries are expanding their renewable energy production. A much cheaper and easier to scale process that will come with its own extraction and recycling challenges within our lifetimes. So the question really is: How much is this worth? Both economically and ecologically.",
    "Bill Gates wanted to try this and had a complete plan to pay for it with his foundation but when they were supposed to start (approved by Obama) Trump shut it all down",
    "Because breeder reactors cost a lot but also can actually be dangerous, unlike the danger conventional nuclear reactors pretty much lack now.",
    "The main benefit of Uranium recycling was never economic. It was always about the amount of dangerous waste produced.",
    "Thanks science for trying to fix the waste problem from Nuclear Power Plans.",
    "Do you want more atomic bombs? because reusing nuclear waste is how you get more atomic bomb material.\n\nIt's really that simple.",
    "That's cool that you CAN recycle nuclear waste, but how much energy does it take? Would it even be beneficial to recycle if it take more/same/half amount of energy that it could produce in it's lifecycle?",
    "i LOVE nuclear energy, im sadly not talented enough to work with it and maybe even build Uranium fuel myself, but these educational videos give me enough reasons to support new nuclear facilities.\nI wish the netherlands would build more nuclear powerplants, its safe its harmless, and you can reproduce the fuel",
    "Now if France could sort out their plumbing issues",
    "Pro nuclear shill propaganda shit.",
    "we know why. USA didn't want to reused them. for they was scary when they made that law. it was made from stupidity and lack of knowledge. and they too scary to change it for its people also lack the knowledge",
    "why? because coal and gas lobby lmao",
    "Most likely, just weapons control (the bomb material is \"embedded\" in the \"waste\") and artificial scarcity,.. money and power.",
    "We should band together to elect nuclear friendly legislatures and pressure current elected officials into implementing more nuclear power. Power through policy!",
    "5:26 isn't it the case that the core actually ABSORBS a slow moving neutron, and breaks apart because it gets unstable?\n..unlike being split by a neutron \"cutting\" through it..",
    "Price per killowat and carb/waste per killowat is till less than 1% of oil. Not to mention we had the first energy positive self sustaining fusion reaction recently. Fusion only leaves helium, no other waste.",
    "I feel like with a product *this* dangerous......recycling is going to cost less lives even if it costs more money.  Idk.  Nuclear products make me so leary",
    "so it is cheaper to just build wind and sun farms",
    "I love how the American professor was all about the money. Nothing new for USA really!!! Good on France for being a leader in this industry.",
    "Also, why aren’t we forcing all of the world’s economies into a fund pool and creating a laboratory in the heart of the Sahara where each nation commits a group of atomic scientists to study this and solve the problem by digging a mile or so beneath the desert and solving for x? X here being recycling, reusing and sending the spent fuel into the actual Sun?",
    "Nuclear waste? Wait... according to fans of nuclear power, this DOESN'T EVEN EXIST!!",
    "Germany could have dominated nuclear research, but some idiotic and pearl-clutching thinking from so-called \"environmentalists\" has thwarted any efforts. The reason why nuclear research is so behind is because of this. Shameful and moronic.",
    "It requires more competency to process down to the final process of it. \nMy nation (USA) is rapidly becoming less competent by the year and every 4 years risks having the policies be stripped or abandoned. \nSeems like it’s a higher skill level, and my country is rapidly falling back to the tutorial missions",
    "Oil millionaires ",
    "\"Only very few countries are reusing nuclear waste. I wanted to find out why.\"\n\nAs Legasov said in HBO's Chernobyl mini-series: \"It's cheaper.\"",
    "Australia recycles nuclear waste by reprocessing spent fuel rods in other countries and then returning the waste by-products to Australia:",
    "Shoutout to your local politicians and presidents for making it impossible and not profitable to recycle nuclear waste",
    "Argonne labs  is also doing nuclear recycling",
    "Would be cheaper to redistribute nuclear weapons made from recycling to each country in the world. Everyone would have a nuke, and there would be a global stalemate.",
    "because solar and batteries make nuclear obsolete. DW is just protecting ORANO's interests",
    "By reusable do you mean shot out of an A-10 gattling gun or dumped off the coast of Japan?",
    "I offered to store nuclear waste in my back shed for $300 a day a barrel but never herd back from anyone.",
    "Thorium?",
    "Give it all to me, I'm hungry and in need of calories",
    "The Orano animations you show appear to be more detailed than those on their website. I wondered if you could direct me to them, I teach nuclear recycling technology and these would be a really good addition.",
    "Yeah you can recycle anything but it's not free. Got it yet?",
    "The video is too short, too uninformative and too hand-wavy.",
    "The answer is ALWAYS Billionaires, they don't fucking care",
    "In germany it is mostly cause to let flow tax money from the people to big companys. We paid with tax for the nuclear plants and then big companys got them for nearly nothing. And now we do the same with \"reusable energy\". And most of the idiots out there think this is for our planet...",
    "9:58 MASSIVE???? YOU KNOW WHAT ELSE IS MASSIVE???",
    "I don't understand why the mox fuel cannot be recycled again? Since it started with more plutonium it would be understandable if it contained more and thus produced more when separated out however this doesn't seem like a problem since you're already producing and using pure plutonium. In theory the recycled fuel rods should be re recycled once spent indefinitely until the fission products are all that remain. Also given the fission products absorb more neutrons than they produce they cannot create a chain reaction thus I don't understand why they have to be trapped in glass beads rather than simply containing them in more concentrated vessels taking up at minimum less space while also using less glass material, or alternatively and preferably further separated and purified to be made useful as other pure materials even if there not useful for energy generation they will be useful for other purposes if not yet then once a sufficient pure supply is stockpiled uses will inevitably be found by industry however these uses will only be found if the individual products are separated rather than simply labelling it mixed fission products. Also why are they simply left in a pool for years to cool down logically during the cooldown process they would be further deteriorating increasing the amount of fission products and reducing the content of fuel as compared to recycling it while hotter or if not recyclable while hot surely we can use the heat given off in a more usefully way than just bleeding it off in a pool and wasting away?",
    "money",
    "The Plutonium from civilian power plants cannot be used for weapons because of physics- it contains wrong isotopes for weapons because it did spend to long time in a reactor. Physics protects us from it being used in weapons. The Indian program was based on abuse of fuel cycle- it is misrepresentation to spread fear about it- no fuel from civil reactors from France, Germany, Finland, or \"properly run\" CANDU is weapons grade. It could however be a great fuel for the future to get rid of coal and gas for electricity and heating(that way Uranium would be practically inexhaustible too)",
    "Whenever you see a question like this, just remind yourself the answer is always \"money\".",
    "Reason Nr. 1 to not live in Germany. Lack of nuclear power plants",
    "One question though: if you compare how polluting it is to store the nuclear waste (including building the storage facilities for it) to how much it pollutes to build and keep up a place like this - in the long run, which will actually cause more pollution?\n\nI am, at the moment, against nuclear power plants for energy, but I am trying to educate myself more on the subject, and see all sides of the coin - both the good and the bad. This video did seem very objective - usually, people only fixate on the good or the bad, so it fits their own narrative or belief.",
    "Considering the marked propensity of humans to sacrifice safety for economic interests over time, and the semi permanent environmental impacts of nuclear fallout, and the fact that rad exposure is fundamentally destructive to human biology, nuclear to me is still a bad idea. With consequences so drastic, you must consider with humans that it's not if but when an incident occurs. And as a result you exclude an already limited portion of our planet as habitat for humans.\n\nWhich is to say, Im glad this technology exists but I don't think our species is developed enough socially or mentally to handle it responsibly. Especially with the security risks introduced by extended handling and transport.\n\nIt may be trite, but consider Homer Simpson at his powerplant, and that is the fundamentally safe assumption to make because all good systems engineering is engineered for idiots. Given the state of our societies..not to mention the potentially catastrophic impacts of war or terrorism, is the risk worth the reward when solar, wind, geothermal, and tidal exists? Regardless I wouldn't want to live anywhere downwind of nuclear, and our fellow species on this rock deserve better than to live in a fallout game.",
    "Use it to make uranium glass and make lavalamps. You'll set your kitchen on fire and you might even get super powers.",
    "The answer for, \"why we don't X\" is usually because it's not profitable and costs money.",
    "ok, so if \"spent\" fuel is still able to produce 200 to 400 degrees of heat..  Well, why couldn't it run a smaller power plant?",
    "The US invented that technology, but they’re too lazy to keep it going",
    "We should be using Nuclear Energy tbh",
    "no frog, you cant really use  expect for  military grade equipment",
    "France has the strategic thinking I miss with a lot of european countries...",
    "Doesn't surprise me the French are willing to spend money to recycle and the Yank lady just flat out says \"screw that! Its expensive! We don't care!\"",
    "9:58 You know what else is massive? LLLLOOOOOOOOOOOOWWWWWWWWW TAAAAPPPERRRRRRR FADEEEEEEEEEE",
    "More money to be made in digging up the planet and then getting paid to store the waste.",
    "3.7k comments and all of them are experts on the matter? tell me dead internet theory is not upon us",
    "No, it isn't.",
    "Because we have been indoctrinated to fear it by the elites at Davos. In favour of fraudulent \"green\" energy.",
    "Theres nuclear bacteria that can be used to help break down nuclear waste, governments can also help finance researchers, microbiologists and bioengineers to help develop different strains of said bacteria.",
    "i wish i was french so bad right now.",
    "The cost the cost! Omgosh the cost is too great! The costs won't matter when were all dead because we ran out of resources then couldn't develop the technologies and infrastructure fast enough to recycle all of our waste back into usable materials. This is not just a nuclear waste problem, everyone laments the cost of recycling in all areas of all things.",
    "Coal and oil lobbyists",
    "Because a bunch of oil Barrons convinced a bunch of dumbass climate activists that fossil fuels are somehow safer and less polluting than nuclear energy, based off of Russians cuttting corners before modern understanding of nuclear energy safe storage.",
    "Now with SpaceX it's soon going to be cheaper and easier to just fire the waste into the sun.",
    "Plutonium is hard to contain",
    "Very informative, thank you. Your film helps demystifying nuclear energy production.",
    "I was born and grew up in the nearest big city (Cherbourg) next to that recycling center, and my dad worked there for many years. Recycling used nuclear fuel seems perfectly normal to me and I'm surprised other countries aren't doing it.",
    "Depleted uranium is really good to be turned into tank rounds",
    "Is there a way to make a reactor out of plutonium? Would it possibly be safer than uranium? I know with uranium you just put enough uranium 235 in the same space and you will get super criticality. Like the uranium nuke dropped on japan they didn’t even test. They just shot one chunk at another chunk. The plutonium one was more complicated because they had to use shape charges to compress the plutonium to get it to a density to go super critical. Maybe I’m wrong. Maybe the plutonium is more radioactive so it “fissiles” and blows apart before it can get super critical and explode in an efficient manner. Idk. I’d still think you could use the plutonium to make a reactor. Maybe mix it with uranium 238 or would that make more plutonium? Would that be bad? As the plutonium decays it would also produce a byproduct of plutonium instead of some crazy isotope that’s unusable?",
    "Weapons grade plutonium as a byproduct??? I just started the video. But that’s what i heard.",
    "So we should thank US and their fear of being dethroned for the nuclear waste problem, I see.",
    "I've learned that you can recycle everything when you find the right methods and ways to do so.\nEven Nuclear waste.\nWe never got to recycle due to lack of practice with it and due to many Nuclear Powerplant being shut down.\nEspecially here in Germany.\nI am sure we would already found ways to recycle the waste.\nBut sadly the people are dumb and can only relate to Chernobyl when seen/talk about Nuclear Power.\nThe people that created Nuclear Power,Reject it the most.",
    "Because you're Germans. \nGermans are always freak out with nuclear. \nAll anti nuclear movement are from Germany.",
    "Don't use nuclear fuel and nuclear energy and the problem will be solved.",
    "They made Satisfactory in real life lol wtf",
    "Because you can make nuclear bomb with it",
    "Easy for France to blow a butt load of money when they’re not paying for the defense in NATO!",
    "Future generations will damn us for not bending down and pick up that clean and abundant energy source. Get to building MSR's as of now! In my country we already have regular blackouts because the climate-idiots made the politicians go for wind and solar. On christmas eve last year, 30.000 people had no electricity - and thereby no heat as well - form 4PM till 10PM. Crazy to state, that MSR's are \"still in the lab\" when they were developed in the 1950's.",
    "where is the fucking watch later button",
    "64% wtf\nThe infrastructure is amazing ",
    "I think it’s because that last 4% is so un-reusable it ruins the other 96% without very dangerous intervention.",
    "It's easier to throw it in the ocean",
    "I'm beginning to wonder is nuclear material really dangerous to humans? What did COVID-19 teach you?",
    "So the spent Nuclear Fuel Rods (NuF-Rods) have to be cooled under the water, why arn't you's creating a way to harness the heat they give off say via TEG's (Thermal Electric Generator's), if these NuF-Rods are giving off heat for a few years then use that heat to generate more power... In theory you may be able to generate another 20% or even 30% of electricity while your waiting for the NuF-Rods to cool down and as the gentleman said, for a few years.",
    "Smart move. Didn't know that France recycles their fuel. Go France!",
    "Gee you think the US could learn something.",
    "Because how does that make money :)",
    "Germany the land of hurricanes, tsunami and earthquakes, rejecting nuclear is a clear choice",
    "Because no one in the media and in politics dare to take time and explain. Every time something is complicated they just skip it.\n\nThis makes people dumb, so they vote dumb. Easy.",
    "Wait until they unlock ficsonium",
    "Germany has a total failure for its energy strategy. Don't tell other people outside Germany what is new in energy.",
    "We very much appricate electricity, im a bit of a lightening type myself. Happy holidays",
    "its crazy what we do  to boil water",
    "Very interesting thank you.",
    "Tldr.",
    ">>>>$$$$$$$$<<<<<",
    "When rods are new with rubber gloves they can be handled in gloved hand only two years the have become very radioactive and are swapped out and replaced. The IS has around 500,000 metric tones of rods in fuel pools. There are 90 fuel pools around the world all requiring off site AC Power. If we have a nuclear war or. Carrington Lever Solar super storm will cause Electromagnetic Pulse will kill all the Electrical Grids and the Cooling water to 450 reactors and 90 Nuclear fuel pools will overheat the Reactors will catastrophically melt down and the 90 fuel pools will boil off and the fuel’s xirconium coating will catch fire when exposed to air.the fuel pool fires will accelerate the drying up of the water exposing more and more rods to air and they to will catch fire in a thermal runaway unquenchable fire like EV batteries.\n\nBy this time the world will have 450 Fukushimas and 90 unquenchable huge nuclear fuel fires while will irradiate everything everywhere and all life around the planet will start to die of radiation poisoning right down to bacteria. \n\nIt will be an ELE or EXTINCTION LEVEL EVENT.\n\nGoogle Scholar search Nuclear Fuel Pool Fires. The Carrington Solar super storm was estimated as an X45. It happened in 1859 and it’s cycle is around 100 years so it is well overdue. When it happened it melted telegraph wire set fire to telegraph poles and telegraph offices and the office in Sweden was able to transmit back a d forth with the office in India for 8 hours wirelessly as the batteries were wrecked. \n\nIf that hit us now it would crash the worlds AC Grids and cause 460 nuclear reactors to melt down and the 90 fuel pools to catch fire.\n\nWe are like ducks in a shooting gallery with the Sun taking pit shots at us. In July 2012 we missed a killshot by 8 days and a few years pater we missed one by four days. Governments never address any of this because they can do nothing in the face of it so they keep quiet and cross their fingers behind their backs.",
    "Two Real and Present Dangers \n\nA Global Thermo Nuclear War.\nA 1859 Carrington X 45 level or greater Solar Storm.\nA nuclear war or  Solar Super storm would collapse the planet’s electrical power grids through EMP Electro Magnetic Pulses.\nAs a result all cooling water would stop flowing to cool Nuclear Fuel in both Reactors and Fuel Storage Pools.\n\nIt is the Dirty Secret the IAEA has kept from the public since the beginning of the nuclear age.\nDespite full knowledge of the risk of the Sun Super flaring which is overdue by decades or the inevitable Nuclear War.\n\nThe consequences of either is Extinction of all Life on Earth.\n\nGoogle information\n\nThere are 90 Hot Nuclear Fuel Storage Pools in the World.\n\nGeneration\nThe U.S. generates about 2,000 metric tons of spent fuel each year\n\nReprocessing\nAbout two-thirds of spent fuel is in storage while the other third was reprocessed. \n\nPeople also ask\n\nHow much spent nuclear fuel is there in the world?\n\n390,000 tonnes\n\nSince the start of nuclear electricity production in 1954 to the end of 2016, almost a decade ago there were some 390,000 tonnes of spent fuel were generated. About two-thirds is in storage while the other third was reprocessed.21 Jan 2022\n\n390,000 tones of hot nuclear fuel rods. In 90 Nuclear Fuel ponds would be 4,333 tones per pond.\n\nWhat happens If the pools permanently loose off site AC power\n\nIf there is a prolonged interruption of cooling due to emergency situations, the water in the spent fuel pools may boil off, possibly resulting in radioactive elements being released into the atmosphere.\n\nA nuclear War or a Carrington Level Solar Storm capable of the Electromagnetic Pulse crashing the Global Electric Grids\nWould cause the irradiation of the entire planet from the release of radioactive Elements of 390,000 metric Tones of highly radioactive elements into the atmosphere. Not all at once but continually as a flood of nuclear radiation lasting for centuries millennia or much longer.\n\nNuclear fuel rods are stored in steel-lined concrete pools surrounded by water. The water in a fuel pool is usually between 25°C and 35°C, and every 7 centimeters of water cuts the amount of radiation in half. \n\nNuclear fuel rods become more radioactive as they are used in a reactor. A fresh rod of low enriched uranium pellets can be safely handled with gloved hands, but after a year or two of use, it becomes highly radioactive and unsafe to approach without many feet of water shielding. \n\nWhen the pools loose their water the fuel’s Zirconium coating self ignites when in contact with air, like Sodium. These fires are thermal runaway like Lithium batteries and are extremely hot and near impossible to quench.\n\nA fire from spent fuel stored at a U.S. nuclear power plant could have catastrophic consequences, according to new simulations of such an event.\nA major fire \"could dwarf the horrific consequences of the Fukushima accident,\" says Edwin Lyman, a physicist at the Union of Concerned Scientists, a nonprofit in Washington, D.C. \n\n\n“We're talking about trillion-dollar consequences,\" says Frank von Hippel, a nuclear security expert at Princeton University, who teamed with Princeton's Michael Schoeppner on the modeling exercise.\nThe revelations come on the heels of a report last week from the U.S. National Academies of Sciences, Engineering, and Medicine on the aftermath of the 11 March 2011 earthquake and tsunami in northern Japan. The report details how a spent fuel fire at the Fukushima Daiichi Nuclear Power Plant that was crippled by the twin disasters could have released far more radioactivity into the environment.\n\nThe nuclear fuel in three of the plant's six reactors melted down and released radioactive plumes that contaminated land downwind. Japan declared 1100 square kilometers uninhabitable and relocated 88,000 people. (Almost as many left voluntarily.) After the meltdowns, officials feared that spent fuel stored in pools in the reactor halls would catch fire and send radioactive smoke across a much wider swath of eastern Japan, including Tokyo. \n\nBy a stroke of luck, that did not happen.\nBut the national academies's report warns that spent fuel accumulating at U.S. nuclear plants is also vulnerable. After fuel is removed from a reactor core, the radioactive fission products continue to decay, generating heat. All nuclear power plants store the fuel onsite at the bottom of deep pools for at least 4 years while it slowly cools. To keep it safe, the academies report recommends that the U.S. Nuclear Regulatory Commission (NRC) and nuclear plant operators beef up systems for monitoring the pools and topping up water levels in case a facility is damaged. The panel also says plants should be ready to tighten security after a disaster.\n\nAt most U.S. nuclear plants, spent fuel is densely packed in pools, heightening the fire risk. NRC has estimated that a major fire at the spent fuel pool at the Peach Bottom nuclear power plant in Pennsylvania would displace an estimated 3.46 million people from 31,000 square kilometers of contaminated land, an area larger than New Jersey. But Von Hippel and Schoeppner think that NRC has grossly underestimated the scale and societal costs of such a fire.\n\nNRC used a program called MACCS2 for modeling the dispersal and deposition of the radioactivity from a Peach Bottom fire. Schoeppner and Von Hippel instead used HYSPLIT, a program able to craft more sophisticated scenarios based on historical weather data for the whole region.\nNightmare scenarios\nA simulated spent fuel fire at the Peach Bottom nuclear power plant in Pennsylvania had a devastating impact on the mid-Atlantic region. Click on the dates to see the extent of contamination, which depended on weather patterns. Courtesy of F. Von Hippel and M. Schoeppner  \n1 Jan. 20151 April 20151 July 20151 Oct. 2015\nIn their simulations, the Princeton duo focused on Cs-137, a radioisotope with a 30-year half-life that has made large tracts around Chernobyl and Fukushima uninhabitable. They assumed a release of 1600 petabecquerels, which is the average amount of Cs-137 that NRC estimates would be released from a fire at a densely packed pool. It's also approximately 100 times the amount of Cs-137 spewed at Fukushima. They simulated such a release on the first day of each month in 2015.\nThe contamination from such a fire on U.S. soil \"would be an unprecedented peacetime catastrophe,\" the Princeton researchers conclude in a paper to be submitted to the journal Science & Global Security. In a fire on 1 January 2015, with the winds blowing due east, the radioactive plume would sweep over Philadelphia, Pennsylvania, and nearby cities. Shifting winds on 1 July 2015 would disperse Cs-137 in all directions, blanketing much of the heavily populated mid-Atlantic region. Averaged over 12 monthly calculations, the area exposed to more than 1 megabecquerel per square meter -- a level that would trigger a relocation order -- is 101,000 square kilometers. That's more than three times NRC's estimate, and the relocation of 18.1 million people is about five times NRC's estimates.\nNRC has long mulled whether to compel the nuclear industry to move most of the cooled spent fuel now held in densely packed pools to concrete containers called dry casks. Such a move would reduce the consequences and likelihood of a spent fuel pool fire. As recently as 2013, NRC concluded that the projected benefits do not justify the roughly $4 billion cost of a wholesale transfer. But the national academies's study concludes that the benefits of expedited transfer to dry casks are fivefold greater than NRC has calculated.\n\"NRC's policies have underplayed the risk of a spent fuel fire,\" Lyman says. The academies panel recommends that NRC \"assess the risks and potential benefits of expedited transfer.\" NRC spokesperson Scott Burnell in Washington, D.C., says that the commission's technical staff \"will take an in-depth look\" at the issue and report to NRC commissioners later this year.\n\ndoi: 10.1126/article.2332461\n\nAs for the Sun we spent 24 years GPS and Field of View Recording and logging petroglyphs (Ancient Rock Engravings)  at every Latitude  and Longitude on Earth. Our ancestors have been recording giant Solar Super Events for st least 60,000 years.\n\nPublished papers here\nhttps://plasmauniverse.info/NearEarth.html",
    "because the globalists want to create crisis situations so they can be the first to come up with powergrab solutions",
    "Never mentioned\n What is the cost of recycling nuclear waste?",
    "Regardless of the \"benefits\" of nuclear, and any other type of power generation...a well run c I sl fired plant with scrubbers is the safest, cheapest, most productive way to generate heat/steam.",
    "FINALLY, a video talking about nuclear waste in a serious and dedicated form.",
    "they say it's no need spending money on recycling when there's so much free uranium left. but that's the same as saying \"there's so much coal left, why look for alternatives now and not later?\" which to me sounds ridiculous. maybe it is very costly but in the time we use the mined uranium we have tons of waste just sitting there and expiring, instead of saying the pure uranium and using up whatever we can before picking it up. i know nothing about stuff like this but this is just what i think",
    "The only drawback about this particular fuel. Like you mentioned in the introduction the waste last forever perhaps one day a science might discover a way too deactivate the waste material mainly for peace of mind.",
    "because the governments don’t want to reuse the world, they don’t care",
    "The majority of nuclear waste is not nuclear fuel. It’s all of the equipment and pretty much everything that has been contaminated. So no. Not more than 90 percent can be recycled. It’s a looooot less. I think the recyclable amount is close to 3 percent",
    "nuclear power generation waste = some plutonium\n\nit is weird all those brains putting uranium to a finest grade but cannot think how to extract power generation from plutonium",
    "Thanks for the info! New follower here from Manila Philippines.",
    "All of that plutonium \"nuclear waste\" could serve as explosive propulsion charges for large space vessels as proposed in Project Daedalus, it will almost certainly be put to use at some point for this purpose if humanity can manage to avoid destroying itself.",
    "Cool",
    "We should use renewable energy to restore nuclear waste to its usable form. It can then be used as a store of energy.",
    "the greenest of possible energy",
    "We are a type 0 Civilization",
    "wait, so why to they separate uranium from plutonium if it gets mixed back together at the facility it is sent to??",
    "Please hurry and complete the problem for cold fusion.",
    "We dont recycle it because ot is to fucking dangerous to di so.",
    "But what about Fusion",
    "Yeah well duh that's what radioactivity is that's f****** a reaction that creates energy",
    "But surely the spent nuclear fuel is still hot and could drive steam turbines?",
    "United states needs to start recycling in mass numbers for nuclear waste",
    "The nuclear life extender",
    "Not a word about Russians achieving full closed cycle.\n\n\"According to the results of a year of reliable and safe operation with an almost full load of MOX fuel, the power unit with the BN-800 reactor of the Beloyarsk NPP proved the readiness of the closed nuclear fuel cycle technology for implementation on an industrial scale\"\n\n Crappy info material",
    "We as a civilisation do not have the discipline, we can't even keep our air and water clean..",
    "So now are german TV's promoting nuclear. It just took sky rocketing price spike on energies",
    "It's almost like it would diminish the fossil fuel profits.",
    "Relax!  It’s cheaper and more practical to just use new stuff.  We’ll get to the stored stuff when it’s practical to do it. It’s not like it’s going anywhere.",
    "Because capitalism",
    "leople should stop using this poisonous texhnology.",
    "Of course, it's the same problem that is destroying our society and our planet on multiple fronts: the \"cost problem\".",
    "Fascinating video and I have a question, not sure if you can answer. The big drums used for transport. Noticed they are essentially heat spreaders. How much heat is \"externally\" released by the waste? Could the shielding be reduced to increase the heat being released and still block the harmful radiation?\n\nWhat I am thinking is could that decay of the waste be harnessed with a generator using a Sterling Engine and the heat being radiated used for the power of that engine? You mentioned that the water cooling takes 5 years, how long would that heat exists without the water cooling in a radiator style container?\n\nIf this is viable it would be an amazing use for some of the material.",
    "Still cheaper than war.",
    "Because the greens closed down the \"schneller brüter\" ages ago. Funded by sowjetrussia to make germany weak. They also funded the closure of coal mines - so germany could not produce steel fir tanks. And china overproduces steal to destroy western production to make the whole west helpless in the case of an aggression..\n\nThis time is now.",
    "Wow. Well done France.",
    "you have less waste using  CANDU reactor as it requires 30% less fuel. and   it will happily run on waste fuel from other nuclear reactors. seams odd that India bough fuel from the US. as the CANDU reactor was specifically built to  run on raw uranium without the need of enrichment from  Canadian mines that natural have more 235 then most raw uranium out there. if it was using US uranium then India was using spent or enriched uranium from the US.. as CANDU  produces very little  plutonium ( and other radio active isotopes) compared to other reactors out there as it gets digested in the CANDU reactor",
    "What I'm more worried about nuclear waste, are the older versions that are much much stronger than what's produced today. There are only cleanups done when locations are found, which is even more disturbing, because it just takes one crazy person to make use of that waste in a very bad way. A kid once made a reactor. Whats to stop a terrorist from building something worse with all the instructional videos on youtube. I got a chuckle out of Back to the Future when the scientist tells Marty \"Im sure you can buy plutonium at any 7-11 in your time, here it's quite rare\" Not in those exact words, but close. \nPlutonium I think is waste left over from this planets creation to begin with. If there are ways to use the waste up safely, they should be doing this. Before a nutjob finds something bad to make.",
    "There is simple answer, you cant earn from it. xD",
    "LOOOOOOOOOOOOOOOOOOOOLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLL",
    "Just sell all waste to Russia, they can recycle it unlike undeveloped nations",
    "Despite the cost and use of recycling can reduce the volumn of wastes... remaining wastes are already huge in its volumn. Don't forget those waste storage facilities are all on/in the lands where already destroy the greens forever...\nWhat is so good about nuclear power then..",
    "Just so you all know, the EU often sh*ts on france for their nuclear power usage… \nEven countries that use mostly fossil fuels for energy, those same fossil fuels that directly and actively make the world worse as they are used… yup",
    "Nuclear briefcase becomes literal some day, just imagine a bomb well armed the size of just a simple large traveller bag.",
    "is the \"potential\" word have meaning?",
    "Too expensive, too time consuming, too complex to plan... like everything about nuclear power.",
    "Money",
    "Why is it DW Planet A  are you telling me there is a Planet B",
    "Because  it doesn't  make as much money as the lithium  Electric  lie.",
    "Thank you very informative!",
    "By the time Japan gets it built it would be obsolete in technology",
    "Bullshit, what about the radioactive cooling waterlike the radioactive lake at Chernobyl!!!",
    "I’d love the full video!",
    "We already do.. I mean, ' Dew.",
    "Because humans are trash and don't reuse anything",
    "My question is why does France not sell the excess uranium at the market price so avoiding the cost of storing it. France after all has paid for its recycling so any sales are a bonus and would reduce the total cost. It would also reduce the waste products associated with extracting and refining virgin uranium",
    "They sell it back to the USA to make nuclear weapons",
    "Not 64% its 80%",
    "Why aren't we doing it?\nBucks.",
    "So I wonder if Mr Dutton, Australia's opposition leader who is promoting the notion that Australia should begin using Nuclear Power plants to generate carbon free electricity, even watched a report like this.  The technology that we lack, the knowledge and expertise that we do not have in the country is quite substantial, yet he is claiming that we can have operating nuclear power plants in just 30 or 40 years.  The is a huge underestimation of what is required for Australia to achieve \"safe nuclear power generation.\"  I'd rather think that we  ought to focus our science to making solar/wind/tidal energy more viable, safer.  Nature has been using it for billions of years.  Lets leave the uranium in the ground.",
    "The problem might be that most people have deduhde... its a factor.",
    "Does it mean that these nuclear waste are like plastic waste except that they're radioactive",
    "Your videos just keep getting better and better! This one was fantastic. ",
    "Not bad France",
    "You wouldn't believe whom are the buyers for the waste.",
    "Did you know that we have published research and designed plans on how to produce zero active neclear waist 20 ish years ago and was published in Time magazine. Only issue with the multi stage rebreeder system is that at one stage it produces small amounts of very dirty plutonium and it is potentially possible to refine this dirty plutonium to weapons grade. So due to international treaties it was shelfed.\n\nSince then research has gone into other types of neclear reactors that produce \"safer\" and less waist.",
    "AT 8:16 “WOW” I mean a war profiteering nation like USA who use sanctions to destabilise economies for pettiest reasons and it’s perfect partner a nation built on bodies,blood,sweat,tears of Africans and Indians THE “GREAT” BRITAIN should talk of misuse of nuclear power and that too by a pacifist country like India which has not attacked(first) any countries since hundreds of years. “ HYPOCRISY AT ITS FINEST “ and CANADA a country who can’t even control its own terrorists groups",
    "How about denmarks minireactors?",
    "Spent nuclear fuel rods in the United States are typically stored in pools of water at the power plants where they were used for a number of years to allow the most radioactive byproducts to decay. After this period, they are often transferred to dry cask storage on site.\nThe U.S. does not currently have a permanent repository for its commercial spent nuclear fuel. The Yucca Mountain nuclear waste repository, which was intended to be the long-term storage solution for the country's spent nuclear fuel, was proposed in the 1980s and construction began in 1993. However, the project was halted in 2010 due to political and scientific concerns. As a result, the U.S. is currently facing a growing backlog of spent nuclear fuel that is being stored at power plants around the country! Unfortunately, the current administration’s complacency and its open borders policy. People associated with organizations that utilizes unlawful violence and intimidation, especially against civilians in pursuit of political aims would love to get access to this material! A byproduct of the uranium enrichment process Depleted uranium, someone though “let’s make artillery rounds” even though the primary danger comes from the chemical toxicity and kinetic energy of t said rounds, rather than their radioactivity. Between the Gulf War in 1991 and the Iraq War that began in 2003 the amount of DU rounds fired, makes Iraq ideal to gauge The long-term effects of DU exposure on human health and the environment!",
    "because it's waste. Duh!",
    "Use Thorium as a fuel.  It can consume some nuclear waste and produces waste that is only radioactive for a few years.",
    "The US doesn't recycle. Because the cost doesn't make sense to them. This is what happens when you let regulation increase the cost while free market is completely focused on profits. They have no incentive to recycle",
    "The program calls it recycling. But the rest of the world calls it weapons grade refining",
    "We have the sun that's nuclear. MuSK",
    "For the love of god, for once, build up the recycling infrastructure along side the industry.  Look at the mess we've made with consumer electronic waste, let's not do that with nuclear fuel.",
    "Can we usenit in long haul space ships as fuel",
    "So basically USA is hinderig the advancements in energy sector, as usual... what a shocker...",
    "thorium solves all those problems, consumes u238 as starter fuel, no plutonium byproduct, 1% of radio active half-life, 80+%fuel efficiency, no waste storage problems and thorium is 4x more abundant than uranium and widely distributed throughout the world",
    "THORIUM IS 100% RECYCLABLE.\nMOSTLY, we still don't use it.",
    "So basically, nuclear material is disposed like businesses dispose of harddrives and servers. Why aren't these nuclear materials being sold on ebay? I'd gladly buy some to make a nuclear reactor so I can stop paying expensive electrical bills because my country is filled with lunatics scared of nuclear and in love with high cost",
    "Well thorium fast breeder reactors is answer no waste and safe",
    "If we can generate massive amounts of power from these Nuclear Plants, Why can't we all just grow them in our garden? Why are they kept in these facilities? asking for a friend?",
    "If we recycled all that waste, how would we ever continue to justify forceful occupations of other countries?",
    "Do they really have to cool the rods down, instead of USING all that heat?",
    "There's a misunderstanding of what's called nuclear wastes. you talk about the used rods. But the nuclear wastes aren't only that. the major part of the wastes are not rods, but contaminated materials.",
    "Why isn't every country with nuclear power not recycling? Especially those who are constantly banging their drums about recycling?",
    "I did an undergrad paper on this about 40 years ago.  Ted Ringwood and others came up with synroc in the late '70s after learning that the fission products in the Oklo natural reactor in Gabon of about 2 bya had barely mirgrated in that time.  Its radioative loading is about 4-5x that of the best glasses with the advantages that they are stable at much higher temperatures and have porosity rates a couple of orders lower than the glasses.  Drill into an unfractured-by-glaciation granite pluton about 1 km below the Canadian shield, bury, backfill with self-healing bentonite clays and you're gtg for several million years.  The recoverable energy in Ontario's pools was worth about $300 B in '80s dollars by about 10 years ago and it would've cost about $5-10 B to do it all.  Still, a 30-60x payback can't cut it when it involves the transport of weapons-grade Pu through populated areas.  The French are so French ;-)"
]